{
    "https://pricebaba.com/mobile/lenovo-a2020": {
        "text": {
            "Intro:": [
                "A2020 was launched by Lenovo in India in May 2016 as an upgrade of A2010. It is considered as the most affordable mobile phone in India, with a distinguishable high level of internal storage capacity for the range and some additional features like 5-inch FWVGA display and a Mali T720 GPU paired quad-core 64-bit processor."
            ],
            "Display and Design:": [
                "The phone has a 5-inch touchscreen display with resolution at 480 x 854 pixels having a pixel density of 294PPI. The screen is IPS capacitive touchscreen, 16M colors. Phone is available in Gold and Rose Gold only. Size dimensions are 143.5 x 71.8 x 9 mm and it weighs around 166 grams."
            ],
            "Hardware & Features:": [
                "The phone is powered by quad-core 1.1GHz processor and comes with 1GB RAM. The phone runs on Android 5.1 version (Lollipop) and has an expandable internal storage of 8GB. The phone has certain noticeable features like proximity sensor, ambient light sensor, accelerometer, gyroscope, geo-tagging, touch focus and face detection."
            ],
            "Camera & Storage:": [
                "The phone offers a rear camera of 5MP with LED flash and front camera of 2MP. It has a 1GB RAM and a storage of 16GB and can be expanded up to 32GB through microSD card."
            ],
            "Battery & Connectivity:": [
                "The phone has a removable Li-Ion 2300 mAh battery. It is a single SIM (GSM) smartphone that accepts a micro-SIM. Internet connectivity is possible with Wi-Fi 02.11 b/g/n, GPS /A-GPS, Bluetooth 4.0, and 4G LTE."
            ],
            "Competition:": [
                "The phone faces significant competition from cellphones like"
            ],
            "Frequently Asked Questions (FAQs) About Lenovo A2020": [
                "1. Does this phone support Reliance Jio network?",
                "Ans: This phone does support 4G LTE but lacks VoLTE to make calls from Jio network. However, you may use the Jio 4G Voice app to make calls.",
                "2. What type of charging connector do I need?"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lava-x81": {
        "text": {
            "Overview": [
                "Lava is one of the top 5 Indian smartphone manufacturer that competes with other brands like Micromax, Intex & Karbonn. The company also owns Xolo which has been recently doing well in the market with their budget oriented devices that offers good value for money. Lava X81 is a phone that has an extremely well build body with Metal Unibody construction."
            ],
            "Design and Display": [
                "On the front sits a 5 inch HD (1280x720) display giving the display a pixel density of 294PPI which does sound sharp enough. Unfortunately, there is no Gorilla Glass protection on the display. In terms of design, the phone looks well built and has an unibody construction. The looks of the device somewhat resembles the iPhone 6 without the antenna bands but definitely a good looking device."
            ],
            "Hardware and Features": [
                "You get a MediaTek MT6735 Quad Core chipset clocked at 1.3GHz and there is 3GB of RAM which should be great for average usage with basic apps and should provide a great multitasking experience. On the software front, Lava X81 comes with the latest Android 6.0 Marshmallow out of the box."
            ],
            "Camera and Storage": [
                "On the rear of Lava X81 lies a 13MP camera that can record videos up to 1080p whereas on the front sits a 5MP shooter for those selfie moments. The rear camera also gets a Dual LED Flash for taking videos and pictures in dark plus you also get an LED Flash on the front which is a huge bonus for all selfie lovers. To store all those selfies and other data there is 16GB of onboard storage with expandability option up to 32GB more via a MicroSD card."
            ],
            "Battery and Connectivity": [
                "Powering the device is a 2700mAh non removable battery that should easily last you through the day. On the connectivity front, Lava X81 supports Dual SIMs and also supports 4G LTE networks in India."
            ],
            "Alternatives": [
                "Xiaomi Redmi Note 3",
                "LeEco Le 2",
                "Motorola Moto G 3rd Gen"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/karbonn-titanium-mach-six": {
        "text": {
            "Introduction:": [
                "Karbonn Titanium Mach Six is a dual SIM device that was launched in April 2016. Compactive touch, vibrator mode and voice assisted navigation, VR glass facility are its major highlights."
            ],
            "Display and Design:": [
                "Karbonn Titanium Mach Six comes with 6 inch LCD touch screen fully laminated HD IPS capacitive display, 1280 x 720 pixels screen resolution and 245PPI pixel density. It has a dimension of 160.6 x 87.7 x 8.6 mm and its weight is 163 grams. It is available in Gray and Champagne colours."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with 1.3GHz quad-core processor, Android 5.1 Lollipop Operating System, and 2GB RAM. It has GPS and FM radio. It has a light sensor, proximity sensor, and gyroscope and gravity sensor."
            ],
            "Camera and Storage:": [
                "Karbonn Titanium Mach Six is loaded with 8MP rear camera and 3.2MP front camera. Other camera features include LED flash and autofocus. It has an internal storage of 16GB that can be expanded up to 32GB by using a micro-SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is equipped with a 3300mAh removable Li-ion battery that lets the users enjoy a talk time of up to 6 hours and standby time of up to 180 hours. It takes 4 hours to be charged completely. Users can enjoy connectivity through 3G, 2G, WiFi, and Bluetooth. It takes in 2 normal SIM cards."
            ],
            "Competition:": [
                "Karbonn Titanium Mach Six faces competition from Meizu M3S and Xiaomi Redmi 3S. Meizu M3S 2GB has a lower battery capacity, smaller screen and better rear camera than Karbonn Titanium Mach Six. Xiaomi Redmi 3S has a smaller screen, higher battery capacity and higher rear camera than Karbonn Titanium Mach Six."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/micromax-bolt-a082": {
        "text": {
            "Overview": [
                "3.97 inch screen with a resolution of 800 x 480 pixels, decent 233PPI pixel density",
                "1GHz Dual Core MediaTek processor with 512MB of RAM",
                "4GB of Internal Storage out of which 1GB is for Apps and 1.3GB is for user data",
                "MicroSD card slot with support upto 32GB",
                "2 megapixel fixed focus rear camera with flash, front 0.3 megapixel camera",
                "480p video recording",
                "Removable 1700mAh battery",
                "Android 4.4.2 Kitkat",
                "Front facing Stereo Speakers",
                "Physical Music control buttons below the screen",
                "5 Color option-- Electric Grey,Raging Red,Pristine White,Sunshine Yellow & Cyan Blue"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/panasonic-eluga-note": {
        "text": {
            "Hardware Specifications and Features:": [
                "Panasonic Eluga Note sports the same MediaTek MT6753 Octa Core chipset clocked at 1.3GHz combined with 3GB of RAM. The processor might struggle with heavy tasks but the ample 3GB of RAM should be sufficient enough to handle multitasking well. The device has no major feature, not even a fingerprint sensor."
            ],
            "Software and Design:": [
                "The operating system of the device is based on Android 6.0 Marshmallow out of the box with Panasonic's FitHome UI running on top of it and there as been no info if ever it will receive Android Nougat update. Panasonic Eluga Note has plastic build material but the quality looks quite solid."
            ],
            "Camera and Storage:": [
                "On the rear lies a 16MP sensor that can record videos up to 1080p, whereas on the front is a 5MP camera for video calling and selfies. There is also a Triple LED Flash on the rear of the device that provides ample light while taking low light shots. To store all the data you get 32GB of internal storage which can be expanded up 32GB more via a micro SD card."
            ],
            "Battery and Connectivity:": [
                "Powering the device is a decent 3000mAh non-removable battery that should easily last through the day. The phone accepts Dual SIMs and supports 4G LTE connectivity with VoLTE."
            ],
            "Alternatives:": [
                "Moto G4 Plus",
                "Xiaomi Redmi Note 3",
                "Lenovo Vibe K5 Plus"
            ],
            "Frequently Asked Questions (FAQs) About Panasonic Eluga Note": [
                "1.Does the Panasonic Eluga Note work with Reliance Jio Network?",
                "Ans: Yes, the Panasonic Eluga Note supports VoLTE and will work on Reliance Jio Network.",
                "2.Can this phone's memory be expanded?",
                "Ans: Yes, this phone's memory can be expanded by an additional 32GB using a Micro SD card.",
                "3.Is the battery removable?",
                "Ans: No, the battery on the phone is non-removable.",
                "4.Will this support my Nano SIM card?",
                "Ans: No, the Panasonic Eluga Note has a Micro SIM slot.",
                "5.How is the camera performance for this phone?",
                "Ans: The phone has a 16-megapixel primary camera and a 5-megapixel selfie camera on the front. The camera performs well for the price range and is enabled with Triple LED Flash which provides good image quality in low light conditions.",
                "6.What is the internal storage size available to install apps?",
                "Ans: The phone has approximately 25GB of User Available Internal storage to install apps.",
                "7.What type or charging connector do I need?",
                "Ans: The Panasonic Eluga Note uses a MicroUSB connector and will work well with your existing MicroUSB cables.",
                "8.Does this phone have a hybrid SIM slot?",
                "Ans: No, the Panasonic Eluga Note does not have a hybrid SIM slot."
            ]
        },
        "Pros": [],
        "Cons": []
    }
}