{
    "https://pricebaba.com/mobile/yu-yureka-s": {
        "text": {
            "Introduction:": [
                "Yureka S is a dual SIM device that was launched in August 2016. Robust configuration, metallic and polycarbonate ergonomic design, Saturn rings, 3 element keys, OpenGL ES 3.0 for gaming, fast charging facility, very good cameras and Wolfson codec for superb sound through Yamaha amplifier are its major highlights."
            ],
            "Display and Design:": [
                "Yureka S comes with 5.2 inch LCD touch screen AMOLED display, 1920 x 1080 pixels resolution, 423PPI pixel density and Corning Gorilla Glass 3 screen protector. It has a dimension of 154.8 x 78 x 8.5 mm and its weight is 172 grams. It is available in White, Dark Gray and Rose Gold colours."
            ],
            "Hardware and Features:": [
                "This dual SIM device is equipped with 1.7GHz octa-core Qualcomm Snapdragon 615 processor, 3GB RAM, Adreno 405 graphics and Android 5.1 Lollipop operating system. Light sensor, proximity sensor, accelerometer, compass and gyroscope are in-built."
            ],
            "Camera and Storage:": [
                "Yureka S is built with 13MP rear PureCel camera having 2.2F aperture, autofocus and LED flash and 5MP front camera. Users can record full HD videos at 1080p. Other camera features include zero shutter lag and HDR. It has an internal storage of 16GB that can be expanded up to 64GB by using a micro SD card. Users can use approximately 10GB of storage."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is loaded with 3000mAh non-removable Li-Po battery that provides talk time of nearly 9 hours and standby time of nearly 450 hours. Connectivity options include 4G LTE (India Compatible), 3G, 2G, Wi-Fi, Bluetooth. It has Hybrid Sim Tray (Micro SIM + Nano SIM)"
            ],
            "Competition:": [
                "Yureka S faces competition from Micromax Canvas 5 and Lenovo Vibe K5 Plus 3GB. Yureka S has a bigger screen, higher battery capacity and faster processor than Lenovo Vibe K5 Plus 3GB. Micromax Canvas 5 has lower battery capacity and faster processor than Yureka S."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/xiaomi-redmi-3-pro": {
        "text": {
            "Introduction:": [
                "Xiaomi produced Redmi 3 Pro is a stylish and sleek smartphone that comes with fingerprint reader and has a fast CPU that allows speedy downloads with 4G connectivity."
            ],
            "Display and Design:": [
                "The phone has a 5 inch touchscreen display with resolution at 1280 x 720 pixels and it has a pixel density of 294PPI. The mobile has a Super IPS LCD capacitive touchscreen display with 16M colors. The phone weighs around 144 grams. It is available in Dark Gray, Silver, and Gold colors and comes in size dimensions of 139.3 x 69.6 x 8.5 mm."
            ],
            "Hardware & Features:": [
                "The Redmi 3 Pro mobile is powered by a high speed octa-core 1.5 GHz Snapdragon processor and comes with a 3GB  Snapdragon RAM. The phone runs on Android 5.1 version (Lollipop). On its home screen display, the phone has more of interactive options to explore than installed on any other Android phone."
            ],
            "Camera & Storage:": [
                "The Redmi 3 Pro mobile offers a primary camera of 13MP that takes sharp pictures and a front camera of 5MP for selfie shooters. It has an internal storage of 32GB which can be expanded up to 256 GB with SD card."
            ],
            "Battery & Connectivity:": [
                "The Redmi 3 Pro has a non-removable Li-Ion 4100 mAh battery. The phone offers dual SIM (micro-SIM/nano-SIM, dual stand-by) and both slots support 3G and 4G SIMs. It comes with multiple sensors that include fingerprint sensor, gyroscope, proximity, ambient light, and accelerometer.  Connectivity is possible through Bluetooth 4.0, Wi-Fi 802.11 b/g/n, FM, and USB support are present. "
            ],
            "Competition:": [
                "Other mobile phones that come with almost comparable features in market include LeEco Le 2 and Lenovo Vibe K5 Plus but the Xiaomi Redmi 3 Pro phone still stays ahead of these in its battery capacity, memory expansion and digital zoom."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/hyve-storm": {
        "text": {
            "Introduction:": [
                "Hyve Storm is a dual SIM device that was launched in June 2016. Frame made of aluminum alloy, exclusive look, Apps licensed by GMS, MediaTek MiraVision, and sRGB for rich colours, Phase Detection, Auto-Focus technology, Hyve Care for new guarantee and a sharp sensitivity to light are its major highlights."
            ],
            "Display and Design:": [
                "Hyve Storm comes with 5 inch LCD touch screen capacitive display, 1280 x 720 pixels screen resolution and 294PPI pixel density. It has a dimension of 142.50 x 71.40 x 8.70 mm. It is available in Mystic Gray and Snow White colours."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with 1.3GHz quad-core MediaTek MT6735 processor, Mali-T720 for graphics, Android 5.1 Lollipop Operating System and 2GB RAM. It has GPS and FM radio. Light sensor, proximity sensor, accelerometer, compass and gyroscope are in-built."
            ],
            "Camera and Storage:": [
                "Hyve Storm is loaded with 13MP ISOCELL rear camera and 5MP front camera. Other camera features include autofocus and LED flash. It has an internal storage of 16GB that can be expanded up to 64GB by using a micro-SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is equipped with a non-removable 2000mAh Li-Polymer battery that lets the users enjoy a talk time of up to 14 hours and standby time of up to 240 hours on 4G networks. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, 2G, WiFi, Bluetooth and VoLTE (Works with Jio). It takes in 2 nano SIM cards."
            ],
            "Competition:": [
                "Hyve Storm faces competition from Lenovo Vibe K5, Swipe Elite Plus and Coolpad Mega 2.5D. Lenovo Vibe K5 has a faster processor and higher battery capacity than Hyve Storm. Swipe Elite Plus has faster processor and higher battery capacity than Hyve Storm. Coolpad Mega 2.5D has bigger screen, better front camera and higher battery capacity than Hyve Storm."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/zopo-color-e1": {
        "text": {
            "Introduction:": [
                "Zopo Color E1 is a dual SIM device that was launched in January 2016. Slim frame, 28nm technology, 178 degree wide angle for viewing, large battery capacity, energy-saving chip, power management IC and long time for constant work and games are its major highlights."
            ],
            "Display and Design:": [
                "Zopo Color E1 comes with 5 inch LCD touch screen IPS capacitive display, 1280 x 720 pixels screen resolution and 293.72PPI pixel density. It has a dimension of 145.9 x 71.4 x 8.5 mm and its weight is 137 grams. It is available in 5 colours including Blue, Red, White, Black and Yellow."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with 1.3GHz quad-core processor, 1GB RAM, Android 5.1 Lollipop Operating System and Adreno 510 graphics. Light sensor, proximity sensor, accelerometer and compass are available."
            ],
            "Camera and Storage:": [
                "Zopo Color E1 is loaded with 8MP rear and 2MP front camera. Other camera features include HDR, panorama, dual LED flash, night mode, sport mode, auto focus and smile detection. Users can record full HD videos at 720p. It has an internal storage of 8GB that can be expanded up to 64GB by using a micro-SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is equipped with a 2100mAh Li-Po battery. Users can enjoy connectivity through 3G, 2G, WiFi, and Bluetooth."
            ],
            "Competition:": [
                "Zopo Color E1 faces competition from Xiaomi Redmi 3S, Swipe Elite Plus and Yu Yureka Plus. Swipe Elite Plus has better rear and front camera and higher battery capacity than Zopo Color E1. Yu Yureka Plus has bigger screen, better rear and front camera and higher battery capacity than Zopo Color E1. Xiaomi Redmi 3S has better rear and front camera and higher battery capacity than Zopo Color E1."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/mtech-jazbaa": {
        "text": {
            "Introduction:": [
                "Mtech Jazbaa is a dual SIM device that was launched in October 2015. Good look and good rear camera are its major highlights."
            ],
            "Display and Design:": [
                "Tech gazebo comes with 5 inch LCD touch screen capacitive display, multi touch facility, 1920 x 1080 pixels screen resolution and 441PPI pixel density. It has a dimension of 146.3 x 74.6 x 8.5 mm and its weight is 150 grams. It is available in 2 colours including Silver and Black."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with 1.3GHz Quad-core processor, Android 5.1 Lollipop Operating System and 2GB RAM. Google Talk, Twitter, Facebook chat, YouTube, Gmail, Google Search, WhatsApp, Mtech Zone, Google Play Store are pre-installed. G-sensor and proximity sensor are available. MP3 music player and MP4 video palter are available. Google voice search, E-mail, document readers, handwriting recognition, mms, sound recorder, voice input, screenshot capturing, stopwatch, airplane mode, alarm clock, calculator, calendar, contacts, timer are available."
            ],
            "Camera and Storage:": [
                "Mtech Jazbaa is loaded with 13MP rear camera with 4128 x 3096 pixels image resolution and 8MP front camera. Other camera features include HDR, autofocus, and LED flash and digital zoom. It has an internal storage of 16GB that can be expanded up to 32GB by using a micro-SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is equipped with a removable 2000mAh Li-ion battery that lets the users enjoy a talk time of up to 12 hours and a standby time of up to 300 hours. Users can enjoy connectivity through 3G, 2G, WiFi, and Bluetooth. It takes in 2 micro SIM cards."
            ],
            "Competition:": [
                "Mtech Jazbaa faces competition from Yu Yureka Plus and Intex Aqua Power HD. Yu Yureka Plus has bigger screen, faster processor and higher battery capacity than Mtech Jazbaa. Intex Aqua Power HD has a higher battery capacity, faster processor but lower pixel density than Mtech Jazbaa."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/hitech-air-a9": {
        "text": {
            "Introduction:": [
                "Hitech Air A9 is a dual SIM device that was launched in May 2016. Support for 21 regional languages and 2.5D curved glass are its major highlights."
            ],
            "Display and Design:": [
                "Hitech Air A9 comes with 5 inch LCD touch screen capacitive display, 1280 x 720 pixels screen resolution and 294PPI pixel density. It has a dimension of 147.2 x 73.2 x 8.8 mm and its weight is 125 grams. It is available in White and Black colour."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with 1GHz quad-core MediaTek MT6753 processor, Android 5.1 Lollipop Operating System that can be upgraded to Marshmallow, Mali T720 graphics and 2GB RAM. Call Waiting, call forwarding, call conference, document viewer features are available. It has accelerometer and proximity sensor."
            ],
            "Camera and Storage:": [
                "Hitech Air A9 is loaded with 13MP rear camera having an image resolution of 4128 x 3096 Pixels and 5MP front camera having fixed focus. Other camera features include geotagging, autofocus, and LED flash. Users can record HD videos at 1080p. It has an internal storage of 16GB that can be expanded up to 64GB by using a micro-SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is equipped with a removable 3500mAh Li-ion battery. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, 2G, WiFi, Bluetooth. It takes in 2 normal SIM cards."
            ],
            "Competition:": [
                "Hitech Air A9 faces competition from Videocon Krypton3 V50JG and Intex Aqua Music. Videocon Krypton3 V50JG has a lower battery capacity and faster processor than Hitech Air A9. Intex Aqua Music has larger screen, faster processor and lower battery capacity than Hitech Air A9."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/intex-aqua-ace-ii": {
        "text": {
            "Introduction:": [
                "Intex Aqua Ace II is a dual SIM device that was launched in March 2016. MHL cable, good battery backup and upgradability of VoLTE to FOTA are its major highlights."
            ],
            "Display and Design:": [
                "Intex Aqua Ace II comes with 5 inch LCD touch screen capacitive display, 5 point finger touch facility, 1280 x 720 pixels screen resolution and 294PPI pixel density. It has a dimension of 145.30 x 72.00 x 8.65 mm and its weight is 149 grams. It is available in White colour."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with 1.3GHz quad-core MediaTek MT6735 processor, Android 5.1 Lollipop Operating System, and 3GB RAM. It has GPS and FM radio. Gravity sensor and P-L sensor are present. MIDI, MP3, AMR, AAC, WAV, OGG, AWB are audio formats and video formats include 3GP, AVI, MP4. Google Talk, Twitter, Facebook chat, YouTube, Gmail, Google Search, WhatsApp are available."
            ],
            "Camera and Storage:": [
                "Intex Aqua Ace II is loaded with an 8MP rear camera and 5MP front camera. Other camera features include autofocus, Samsung sensor, Lens 4P/3P, module daling and make daling and LED flash. Users can record HD videos at 1080p. Both front and rear camera can record videos. It has an internal storage of 16GB that can be expanded up to 32GB by using a micro-SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is equipped with a removable 3000mAh Li-ion battery. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, 2G, WiFi, Bluetooth and VoLTE (Works with Jio). It takes in 2 Micro SIM cards."
            ],
            "Competition:": [
                "Intex Aqua Ace II faces competition from Micromax Canvas 5. Micromax Canvas 5 has bigger screen, lower battery capacity and better rear camera than Intex Aqua Ace II."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/karbonn-quattro-l55-hd": {
        "text": {
            "Introduction:": [
                "Karbonn Quattro L55 HD is a dual SIM device that was launched in July 2016. Slim and dual tone body, multi language support, GPS navigation, vibrator mode and VR glasses are its major highlights."
            ],
            "Display and Design:": [
                "Karbonn Quattro L55 HD comes with 5.5 inch LCD touch screen capacitive display, 1280 x 720 pixels screen resolution and 267.02PPI pixel density. It has a dimension of 152 x 77.2 x 8.9 mm and its weight is 170 grams. It is available in Blue colour. The keypad has a White coloured backlight."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with 1.3GHz quad-core processor, Android 5.1 Lollipop Kandy UI 1.0 Operating System, and 2GB RAM. It G-sensor, light sensor and proximity sensor. Calculator, Notes, To-do list, World clock, Organizer, Google Apps and Karbonn Apps are available."
            ],
            "Camera and Storage:": [
                "Karbonn Quattro L55 HD is loaded with 13MP rear camera and 5MP front camera. Other camera features include LED flash, geo tagging, smile detection, gesture shot, face detection, voice capture, face beauty and auto focus. It provides 5 different modes for capturing photos. It has an internal storage of 16GB that can be expanded up to 32GB by using a micro-SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is equipped with a 2700mAh non-removable Li-ion battery that lets the users enjoy a talk time of up to 9 hours and standby time of up to 130 hours. The battery takes 4 hours to get charged. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, 2G, WiFi, Bluetooth and VoLTE (Works with Jio). It takes in 2 micro SIM cards."
            ],
            "Competition:": [
                "Karbonn Quattro L55 HD faces competition from Meizu M3S. Meizu M3S has smaller screen and higher pixel density than Karbonn Quattro L55 HD."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lenovo-a6600": {
        "text": {
            "Introduction:": [
                "Lenovo A6600 is a dual SIM device that was launched in September 2016. In-plane switching, 180 degree angle for viewing, decent configuration, 4G connectivity and good battery capacity are its major highlights."
            ],
            "Display and Design:": [
                "Lenovo A6600 comes with 5 inch LCD touch screen capacitive display, 1280 x 720 pixels screen resolution and 294PPI pixel density. It has a dimension of 141 x 71 x 8.8 mm and its weight is 142 grams. It is available in Matte White and Matte Black colours."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with 1GHz quad-core MediaTek MT6735P processor, Mali-T720 graphics, Android 6.0 Marshmallow Vibe UI Operating System, and 1GB RAM. It has light sensor, accelerometer and gyroscope."
            ],
            "Camera and Storage:": [
                "Lenovo A6600 is loaded with an 8MP rear camera having CMOS sensor and 3264 x 2448 Pixels image resolution and 2MP front camera having fixed focus. Other camera features include auto focus, face detection, touch to focus, ISO control, exposure compensation, HDR, panorama, digital zoom, continuous shooting feature and LED flash. Users can record HD videos at 720p. It has an internal storage of 16GB that can be expanded up to 32GB by using a micro-SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is equipped with a removable and interchangeable 2300mAh Li-ion battery that lets the users enjoy a talk time of up to 6 hours on 3G and standby time of up to 16.6 Days on 4G. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, 2G, WiFi, Bluetooth and VoLTE (Works with Jio). It takes in 2 micro SIM cards."
            ],
            "Competition:": [
                "Lenovo A6600 faces competition from Motorola Moto G4 Play. Moto G4 Play has faster processor, higher battery capacity, more RAM, better front camera and more expandable internal storage than Lenovo A6600."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/tcl-fit": {
        "text": {
            "Introduction:": [
                "TCL Fit is a dual SIM device that was launched in May 2016. Decent camera and impressive look are its major highlights."
            ],
            "Display and Design:": [
                "TCL Fit comes with 5.5 inch LCD touch screen capacitive IPS display, multi-touch facility, 16M colors, 1280 x 720 pixels screen resolution and 267PPI pixel density. It has a dimension of 151 x 73 x 9 mm and its weight is 172 grams. It is available in Black and White colours."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with 1GHz quad-core MediaTek MT6735 processor, Android 5.1 Lollipop Operating System, Mali T720 graphics and 2GB RAM."
            ],
            "Camera and Storage:": [
                "TCL Fit is loaded with 8MP rear camera and 5MP front camera. Other camera features include autofocus, LED flash, geotagging. Users can record HD videos at 1080p at 30 frames per second. It has an internal storage of 16GB that can be expanded up to 32GB by using a micro-SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is equipped with a 2800mAh Li-ion battery that provides a talk time of up to 28 hours. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, 2G, WiFi, Bluetooth. It takes in 2 normal SIM cards. 4G provides downloading speed of 150 mbps and uploading speed of 50 mbps."
            ],
            "Competition:": [
                "TCL Fit faces competition from Lenovo Vibe K5 Plus, Micromax Canvas Mega 4G and Coolpad Note 5. Lenovo Vibe K5 Plus has a better rear camera and smaller screen than TCL Fit. Micromax Canvas Mega 4G has a lower rear camera and more RAM than TCL Fit. Coolpad Note 5 has more RAM and more internal storage than TCL Fit."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/itel-it1511": {
        "text": {
            "Introduction:": [
                "Itel It1511 is a dual SIM device that was launched in June 2016. Oncell display, 5 point touch support, capacitive touchscreen, excellent faux leather frame, metallic finish and 4G support are its major highlights."
            ],
            "Display and Design:": [
                "Itel It1511 is equipped with 5 inch HD touchscreen TFT IPS display, 1280 x 720 pixels resolution and 294PPI pixel density. It has a dimension of 138.5 x 69.5 x 9.8 mm and weight of 155 grams. It is available in 2 colours including champagne Gold and Black."
            ],
            "Hardware and Features:": [
                "This dual SIM device comes with 1GHz 64 bit quad-core MediaTek MT6735P processor, 1GB RAM, Mali-T720 for graphics and Android 6.1 Marshmallow operating system. G sensor, light sensor and proximity sensor are in-built."
            ],
            "Camera and Storage:": [
                "It comes with 8MP rear and 2MP front camera with dual flash. Geotagging and autofocus features are available. This dual SIM device has an internal storage of 8GB that can be expanded up to 64GB with a micro SD card."
            ],
            "Battery and Connectivity:": [
                "Itel It1511 is loaded with a removable Li-Po battery of 2500mAh that lets the users enjoy a talk time of up to 20 hours in 2G network and up to 13 hours in 3G network. The users can get a standby time of nearly 308 hours. Users can enjoy connectivity through Wi-Fi 802.11a/b/g/n, Bluetooth BT 4.0, GSM 900/1800/1900 MHz, EDGE, GPS, AGPS, OTG and LTE."
            ],
            "Competition:": [
                "Itel It1511 faces competition from slightly higher priced mobile phones like Coolpad Note 3 Lite and Swipe Elite Plus. However, when considering features, Coolpad Note 3 Lite has better rear and front camera and bigger RAM than Itel It1511. Also, Swipe Elite Plus has better camera, higher capacity and RAM than Itel It1511."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/intex-aqua-strong-5-1": {
        "text": {
            "Introduction:": [
                "Aqua Strong 5.1 is a dual SIM device that was launched in August 2016. Elegant look, emergency rescue, turbo download features and VoLTE support are its major highlights. "
            ],
            "Display and Design: ": [
                "Aqua Strong 5.1 comes with 5 inch LCD TN touchscreen FWVGA display with Corning Gorilla Glass 2 screen protector, 854 x 480 pixels screen resolution and 196PPI pixel density. It has a dimension of 141.2 x 72.3 x 9.47 mm and its weight is 150 grams. It is available in Champagne, White and Blue colours. "
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with 1GHz quad-core MediaTek MT6735 processor, 1GB RAM, Android 6.0 Marshmallow Operating System and ARM Mali-T720 MP1 graphics. Various apps like Matrabhasha, Online Software Update, Clean Master, Opera Mini, Opera Max and Saavn are pre-installed. It has GPS and FM radio. "
            ],
            "Camera and Storage:": [
                "This dual SIM device comes with 5MP rear camera having 2592 x 1944 pixels resolution and 2MP front camera with autofocus and dual LED flash. Other camera features include voice capture, smile detection, face beauty and panorama. It has an internal storage of 8GB that can be expanded up to 32GB with a micro SD card. "
            ],
            "Battery and Connectivity:": [
                "Aqua Strong 5.1 is loaded with a 2800mAh non-removable Li-ion battery that provides a talk time from 16 hours to 22 hours and standby time of up to 466 hours. Connectivity options include 4G LTE (India Compatible), 3G, 2G, Wi-Fi, Bluetooth and VoLTE (Works with Jio)."
            ],
            "Competition:": [
                "Aqua Strong 5.1 faces competition from Xolo Era 4G and Karbonn Aura Power 4G. Xolo Era 4G has faster processor, higher pixel density but lower battery capacity than Aqua Strong 5.1. Karbonn Aura Power 4G has higher battery capacity and better rear and front camera than Aqua Strong 5.1."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/whitecherry-mi-bolt": {
        "text": {
            "Introduction:": [
                "Whitecherry MI Bolt is a dual SIM device that was launched in October 2016. Faster multitasking and rapid processing are its major highlights."
            ],
            "Display and Design:": [
                "Whitecherry MI Bolt comes with 5 inch LCD touch screen capacitive display, 960 x 540 pixels screen resolution and 260PPI pixel density."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with 1.3GHz quad-core processor, Android 6.0 Marshmallow Operating System and 1GB RAM. Light sensor, compass, accelerometer and proximity sensor are available."
            ],
            "Camera and Storage:": [
                "Whitecherry MI Bolt is loaded with a 5MP rear camera. There is no front camera. Other camera features include LED flash, digital zoom, touch to focus. It has an internal storage of 8GB. There is no card slot for expanding the internal storage."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is equipped with a removable 2850mAh Li-ion battery. Users can enjoy connectivity through 3G, 2G, WiFi, and Bluetooth. It takes in 2 normal SIM cards."
            ],
            "Competition:": [
                "Whitecherry MI Bolt faces competition from Samsung Z2 Tizen, LYF Flame 8 and Xolo Era 4G. Samsung Z2 Tizen has a smaller screen, lower battery capacity and lower pixel density than Whitecherry MI Bolt. LYF Flame 8 has lower battery capacity, smaller screen and better rear and front camera than Whitecherry MI Bolt. Xolo Era 4G has lower battery capacity, better front camera, lower pixel density than Whitecherry MI Bolt. Xolo Era 4G comes with a Dragontrail glass screen protection which is not present in Whitecherry MI Bolt."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/micromax-bolt-selfie-q424": {
        "text": {
            "Introduction:": [
                "Micromax Bolt Selfie Q424 is a dual SIM device that was launched in May 2016. Camera with face beauty mode and gesture capture, good configuration and 4G support are its major highlights."
            ],
            "Display and Design:": [
                "Micromax Bolt Selfie Q424 comes with a 4.5 inch LCD touchscreen FWVGA IPS display, 217.7PPI pixel density, 16M colours and 854 x 480 pixels resolution.  It is available in White and Champagne colours."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with MediaTek MT6735 processor, 1GB RAM, Android 5.1 Lollipop Operating System and Mali-T720 graphics. Gravity sensor, light sensor and proximity sensors are in-built. Pre-installed applications include Scandid, Indus, App Bazaar, App center, Ixigo cabs, Amazon shopping, Clean master, Hike, Music by Gaana, and CM security Opera mini, M!live, Quikr, Snapdeal, Travel, CM Locks and Wallet. Pre-installed games are Temple run paradise and Arjun prince of Bali. It supports MP4, 3GPP and 3GP video formats and MP3, MID, AMR, AAC and WAV audio formats."
            ],
            "Camera and Storage:": [
                "Micromax Bolt Selfie Q424 is equipped with 5MP AF rear and 5MP FF front camera with LED flash, autofocus and digital zoom. It has an internal memory of 8GB that can be expanded up to 32GB with a micro SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device has 1750mAh Li-Po removable battery that provides a talk time of up to 18 hours and stand by time of up to 260 hours. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, 2G, Wi-Fi and Bluetooth."
            ],
            "Competition:": [
                "Micromax Bolt Selfie Q424 faces competition from Yu Yunique Plus and Samsung Z2 Tizen. Both of these have faster processor and lower front camera than Bolt Selfie Q424. Samsung Z2 has smaller screen and lower battery capacity than Bolt Selfie Q424 whereas Yu Yunique Plus has bigger screen and higher battery capacity than Bolt Selfie Q424. "
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lava-a89": {
        "text": {
            "Introduction:": [
                "Lava A89 is a dual SIM device that was launched in May 2016. Video PIP feature for working and watching videos simultaneously, torch, voice gestures, speedy processor and sound recorder are its major highlights."
            ],
            "Display and Design:": [
                "Lava A89 comes with 5 inch LCD touch screen capacitive display, multi touch facility, 854 x 480 pixels screen resolution and 196PPI pixel density. It has a dimension of 145.5 x 72 x 9.1 mm and its weight is 157 grams. It is available in White and Black colours. It comes in an attractive candy bar design."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with 1.5GHz quad-core Spreadtrum SC9830A processor, Mali-400 MP2 graphics, Android 5.1 Lollipop Operating System and 1GB RAM. Vibration on call connection, auto call recording and flip to mute are available. It has accelerometer, light sensor, proximity sensor and unlimited phonebook memory."
            ],
            "Camera and Storage:": [
                "Lava A89 is loaded with a 5MP rear camera with and a 2MP front camera. Other camera features include dual LED flash, digital zoom, HDR, grid, photo timer and autofocus. Users can record HD videos at 720p. It has an internal storage of 8GB that can be expanded up to 32GB by using a micro-SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is equipped with a 2000mAh Li-ion battery that lets the users enjoy a talk time of 14 hours 15 minutes on 2G networks and standby time of up to 7 hours on 3G networks. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, 2G, WiFi, Bluetooth and VoLTE (Works with Jio). It takes in 2 micro SIM cards."
            ],
            "Competition:": [
                "Lava A89 faces competition from Xolo Era 4G. Xolo Era 4G has higher battery capacity and higher pixel density than Lava A89."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/itel-it5020": {
        "text": {
            "Introduction:": [
                "Itel it5020 is a dual SIM device that was launched in August 2016. Low price and moderately good configuration are its major highlights."
            ],
            "Display and Design:": [
                "Itel it5020 comes with 2.4 inch LCD non- touch screen TFT display, 320 x 240 pixels resolution and 167PPI pixel density. It has a dimension of 124.5 x 54 x 11.4 mm and its weight is 136 grams. It is available in Blue and Black colours. It has a screen to body ratio of 29.18 %."
            ],
            "Hardware and Features:": [
                "This dual SIM device is equipped with Spreadtrum processor and proprietary operating system. It has wireless FM and Facebook. Calculator, alarm, stopwatch and calendar are some of the in-built applications. Call waiting and call forwarding features are also available in the phone."
            ],
            "Camera and Storage:": [
                "Itel it5020 is built with 2MP rear camera with 1600 x 1200 Pixels resolution and digital zoom. It has a 0.3MP front camera with features including geotagging and autofocus. It has an internal storage of 64MB that can be expanded up to 32GB with a micro SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is loaded with 1000mAh Li-ion battery. Users can enjoy connectivity through 2G and Bluetooth."
            ],
            "Competition:": [
                "Itel it5020 faces competition from Samsung Guru Plus, Karbonn K4000 Baahubali, Sansui A11 and Micromax X606. Itel it5020 has a bigger screen than Micromax X606. Sansui A11 has a bigger screen and higher battery capacity than Itel it5020. Samsung Guru Plus has a smaller screen and lower battery capacity than Itel it5020. Karbonn K4000 Baahubali has much a higher battery capacity but lower rear camera than Itel it5020."
            ]
        },
        "Pros": [],
        "Cons": []
    }
}