{
    "https://pricebaba.com/mobile/asus-zenfone-selfie-3gb": {
        "text": {
            "Introduction:": [
                "Asus Zenfone Selfie 2016 (3GB/16GB) is a dual SIM device that was launched in August 2016. Fluid ZenUI interface, ergonomic arc design, eggshell finish, ASUS TruVivid technology and wide variety of colour variations are its major highlights."
            ],
            "Display and Design:": [
                "Asus Zenfone Selfie 2016 (3GB/16GB) comes with a 5.5 inch touchscreen LCD display with a resolution of 1920 x 1080 pixels and pixel density of 401PPI. It has a dimension of 156.5 x 77.2 x 10.8 mm and it weighs 168 grams. The phone has a HD IPS display with 178 degree angle for viewing and Corning Gorilla Glass 4 screen protector. It is available in 6 colours, White, Blue, Red, Gray, Gold and Pink."
            ],
            "Hardware and Features:": [
                "This dual SIM device comes with an octa-core Qualcomm Snapdragon 615 processor, 3GB RAM, Android 5.0 Lollipop operating system and Adreno 405 graphics. Accelerator, ambient light sensor, e-compass, proximity, gyroscope, hall sensor are in-built."
            ],
            "Camera and Storage:": [
                "It comes with a 13MP rear and 13MP front camera with dual colour real tone LED Flash and laser autofocus. Users can record full HD videos at 1080p. Other features include geotagging, face detection, beautification mode, touch focus, HDR, panorama. Asus Zenfone Selfie 2016 (3GB/16GB) is built with an internal storage of 16GB that can be expanded up to 128GB with a micro SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is loaded with 3000mAh Li-Po battery. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, 2G, Wi-Fi, Bluetooth."
            ],
            "Competition:": [
                "Asus Zenfone Selfie 2016 (3GB/16GB) faces competition from Moto G4 Plus 32GB and LeEco Le 2. But, both of them have a better rear and poor front camera and faster processor than Asus Zenfone Selfie 2016 (3GB/16GB)."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/hyve-buzz": {
        "text": {
            "Introduction:": [
                "Hyve Buzz is a dual SIM device that was launched in June 2016. IPX4 certification for water resistance, display having MiraVision and sRGB colours, ergonomically made fingerprint sensor and power button, stylish rubber finish for excellent grip, oleophobic layer for preventing fingerprint smudges, Touch-2-Call technology, volume rocker, back cover having hexagonal LED light for notification, Hyve Care app are its major highlights."
            ],
            "Display and Design:": [
                "Hyve Buzz comes with a 5.5 IPS LCD touchscreen full HD 2.5D arc glass carved display having 1920 x 1080 pixels resolution, 401PPI pixel density and 16M colours. It has a dimension of 151.00 x 78.20 x 10.30 mm and its weight is 154 grams. It is available in 3 colours including Midnight Blue, Wine Red and Twilight Black."
            ],
            "Hardware and Features:": [
                "It is loaded with a 1.3GHz quad-core MediaTek MT6753T processor, 3GB RAM, Android 5.1 Lollipop operating system which can be upgraded to Android Marshmallow and Mali-T720 graphics. Features include resistance to water, fingerprint scanner, resistance to splashing water, GPS, FM Radio. 6 axis gyroscope, accelerometer, light and proximity sensor and e-compass are in-built."
            ],
            "Camera and Storage:": [
                "Hyve Buzz comes with a 13MP rear camera and 5MP front camera. Autofocus, HDR and dual LED flash are available. Users can record full HD videos at 1080p. It has a 16GB internal storage that can be expanded up to 128GB by using a micro SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is equipped with a 2500mAh non-removable Li-Po battery and provides the users with a talk time of 15 hours and standby time of 22 days on 4G networks. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, 2G, Wi-Fi, Bluetooth, NFC and VoLTE."
            ],
            "Competition:": [
                "Hyve Buzz faces a competition from Moto G4 Plus and LeEco Le 2 (64GB). It has lesser battery capacity than others but has an additional sensor, that is the compass or magnetometer and has more colour variants. "
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/intex-aqua-super": {
        "text": {
            "Introduction:": [
                "Aqua Super is a dual SIM device that was launched in November 2015. Microsoft OneDrive with massive storage space, smart wake up, gesture sensing and HotKnot features are its major highlights."
            ],
            "Display and Design:": [
                "It comes with 5 inch LCD HD IPS touchscreen display with 16M colours, 1280 x 720 pixels HD resolution and 293.7PPI pixel density. It has a dimension of 144 x 75.2 x 7.65 mm and its weight is 130 grams. It is available in 4 colours which are Champagne, Gray, Black and White."
            ],
            "Hardware and Features:": [
                "This dual SIM device comes with 1GHz quad-core MediaTek MT6735P processor, 3GB DDR3 RAM, Android 5.1 Lollipop OS. Various apps like Clean Master, Opera Mini, Google Play Store, Newshunt, OLX, Saavn, Chaatz, Skype, Hike and VAS Apps are pre-installed. G-sensor, light sensors and proximity sensor are in-built."
            ],
            "Camera and Storage:": [
                "Aqua Super is loaded with an 8MP rear camera with autofocus and LED flash and 2MP front camera. Users can record HD videos at 1080p. Face detection, panorama, motion tracker mode, multi-angle viewing mode self timer, live photo and smile detection are available. It has an internal memory of 16GB that can be expanded up to 128GB with the help of a micro SD card. It also comes with Microsoft OneDrive with 50GB of free storage on cloud."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device comes with 2150mAh Li-ion removable battery that lets the users enjoy a talk time of up to 6 hours and standby time of up to 250 hours. Connectivity options include portable hotspot, 4G LTE (India Compatible), GPS/AGPS 3G, tethering, 2G, Wi-Fi IEEE 802.11b/g/n, HSDPA/HSUPA/ EDGE /GPRS / WAP and Bluetooth."
            ],
            "Competition:": [
                "Aqua Super have competition from Yu Yuphoria and Gionee Pioneer P6 as these are available with similar features but Aqua Super has better camera and storage than others."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/micromax-canvas-selfie-lens-plus-q345": {
        "text": {
            "Introduction:": [
                "Micromax Canvas Selfie Lens Plus Q345 is a dual SIM device that was launched in June 2015. Capacitive screen supporting multi-touch, sleek design and camera with superb features are its major highlights."
            ],
            "Display and Design:": [
                "Micromax Canvas Selfie Lens Plus Q345 comes with a 5 inch IPS HD LCD touchscreen display having a screen resolution of 1280 x 720 pixels and 293.7PPI pixel density. The screen has a Corning Gorilla Glass 3 protector.  It has a dimension of 143 x 71 x 8.1 mm and its weight is 144 grams."
            ],
            "Hardware and Features:": [
                "Micromax Canvas Selfie Lens Plus Q345 is ran by 1.3GHz quad-core MediaTek MT6582 processor, Mali-400 MP2 graphics, 1GB RAM and Android 5.0 Lollipop operating system. Light sensor, accelerometer and proximity sensor are in-built."
            ],
            "Camera and Storage:": [
                "This dual SIM device is loaded with 8MP rear camera having Sony sensors and Largan lenses and 5MP front camera having Largan lenses and OV sensors. It has autofocus and LED flash. Users can record full HD videos at 720p. Micromax Canvas Selfie Lens Plus Q345 comes with an internal memory of 8GB that can be expanded up to 32GB with a micro SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is loaded with 2800mAh Li-ion battery that lets the users enjoy a talk time of nearly 9 hours and standby time of up to 374 hours on 2G. Connectivity options include 3G, 2G, Wi-Fi, Bluetooth and GPS."
            ],
            "Competition:": [
                "Micromax Canvas Selfie Lens Plus Q345 can face direct competition from Intex Aqua View. However, Micromax Canvas Selfie Lens Plus Q345 has higher battery capacity and faster processor than Intex Aqua View which makes it a better choice among the mobile buyers."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/intex-aqua-4g-strong": {
        "text": {
            "Introduction:": [
                "Intex Aqua 4G Strong is a dual SIM device that was launched in March 2016. Capacitive TFT display with 1 finger touch and gesture capture mode are its major highlights."
            ],
            "Display and Design:": [
                "It comes with a 4 inch touch screen LCD TN display with 800 x 480 pixels resolution and 233PPI pixel density. The screen is protected by Gorilla glass screen protector. It has a dimension of 125.40 x 64.50 x 10.00 mm and its weight is 110 grams. It is available in Gray and Champagne Gold colours."
            ],
            "Hardware and Features:": [
                "Intex Aqua 4G Strong is loaded with 1GHz quad-core MediaTek MT6735M processor, 768MB RAM and Android 5.1 Lollipop Operating System. Various apps like Facebook Messenger, Google Hangout, Twitter, YouTube, Intex Service, Gmail, Google Search, Google+, WhatsApp, Matrabhasha, FOTA, Intex Store, OLX, App Cloud,360 Security, Newshunt, Opera Mini are pre-installed. Gravity sensor is in-built."
            ],
            "Camera and Storage:": [
                "This dual SIM device comes with 2MP rear camera having an aperture of F2.8 and 4:3 aspect ratio. It has a VGA 0.3MP front camera and has LED flash. It has an internal storage 4GB that can be expanded up to 32GB using a micro SD card."
            ],
            "Battery and Connectivity:": [
                "Intex Aqua 4G Strong is equipped with a 1700mAh removable Li-ion battery that lets the users enjoy a talk time of up to 6 hours and standby time of nearly 240 hours. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, GPRS, EDGE, 2G, Wi-Fi 802.11 a/b/g/n/ac, Bluetooth and VoLTE."
            ],
            "Competition:": [
                "Intex Aqua 4G Strong faces completion from Phicomm Energy 653 and Micromax Canvas Spark 3 Q385 as these have comparable features.  Phicomm Energy 653 and Micromax Canvas Spark 3 Q385 have a bigger screen and better camera than Intex Aqua 4G Strong. "
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/gionee-p5l": {
        "text": {
            "Introduction:": [
                "Gionee Pioneer P5L is a dual SIM device that was launched in April 2016. Oncell capacitive screen, customised UI to go with the body, VoLTE support and HD sound clarity are its major highlights."
            ],
            "Display and Design:": [
                "Gionee Pioneer P5L comes with a 4.7 inch TFT LCD display, screen resolution of 854 x 480 pixels and 208PPI pixel density. It has a dimension of 142.8 x 74.3 x 8.6 mm and its weight is 150 grams. It is available in 6 colours including Blue, Red, Black, Yellow, Gold and White."
            ],
            "Hardware and Features:": [
                "This dual SIM device comes with 1.3GHz quad-core MediaTek MT6582 processor, 1GB RAM, Mali 400 MP2 graphics and Android 5.1 Lollipop Operating System. Proximity sensor, motion sensor, digital compass, accelerometer and G sensors are available. Child Mode, WPS Office, Gionee Xender, Snapdeal, Whatsapp, Facebook, TouchPal 2015, Battery Doctor, 360 Security Lite, Clean Master, Hungama are built-in."
            ],
            "Camera and Storage:": [
                "Gionee Pioneer P5L is built with an 5MP rear and 2MP front camera. Autofocus and LED flash are available. Users can record full HD videos at 1080p. Other features like geo-tagging, scan, professional, panorama, night, GIF, PIC note, HDR, face beauty, filter are present. This dual SIM device is loaded with an internal storage of 16GB that can be expanded up to 32GB using a micro SD card."
            ],
            "Battery and Connectivity:": [
                "It comes with a removable Li-ion battery of 2300mAh that provides the users a talk time of 24 hours on 2G and 9 hours on 3G. You will get a standby time of 500 hours on 2G, 300 hours on 3G and 275 hours on 4G. Users can enjoy connections through Wi-Fi 802.11 b/g/n, Wi-Fi Direct, EDGE, GPRS, Bluetooth V4.0."
            ],
            "Competition:": [
                "Gionee Pioneer P5L can face direct competition from Panasonic Eluga Icon and Coolpad Note 3 as these are available in similar price range. However, these competing smartphones have bigger screen size, higher battery capacity and better camera than Gionee Pioneer P5L."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/intex-aqua-a1": {
        "text": {
            "Introduction:": [
                "Intex Aqua A1 is a dual SIM device that was launched in January 2015. Lightweight body, easy to grip facility, TFT colour pattern and 262K colors are its major highlights."
            ],
            "Display and Design:": [
                "Intex Aqua A1 has a 4 inch LCD touchscreen WVGA display that provides a screen resolution of 800 x 480 pixels and pixel density of 233.2PPI. It has a dimension of 125 x 53.6 x 10.3 mm and its weight is 107 grams. It is available in Black colour."
            ],
            "Hardware and Features:": [
                "This dual SIM device is run by 1GHz dual-core MediaTek MT6572 processor, 512MB RAM, Mali-400 graphics and Android 4.4 KitKat operating system. It has an in-built accelerometer, light sensor, proximity sensor and gyroscope. FM radio with recording facility is also available."
            ],
            "Camera and Storage:": [
                "This dual SIM device is loaded with 5MP rear and 0.3MP VGA front camera with LED flash. HDR, panorama, face detection and continuous shot facilities are obtainable. Intex Aqua A1 is a dual SIM device with an internal storage of 4GB that can be expanded up to 32GB with a micro SD card."
            ],
            "Battery and Connectivity:": [
                "Intex Aqua A1 comes with a 1400mAh removable Li-ion battery that lets the users enjoy a talk time of up to 5 hours and standby time of 180 hours on 2G network. Connectivity options include 3G, 2G, Wi-Fi, GPRS, EDGE and Bluetooth."
            ],
            "Competition:": [
                "Intex Aqua A1 can face direct competition from Infocus Bingo 10 and Lava Iris Fuel F2. Infocus Bingo 10 has a bigger screen and better front camera than Intex Aqua A1. Lava Iris Fuel F2 has a bigger screen than Intex Aqua A1."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lyf-water-11": {
        "text": {
            "Introduction:": [
                "Water 11 is a dual SIM device that was launched in September 2016. HotKnot technology for fast and easy exchange of data, smart gesture and motion control to create shortcuts for various tasks, various gesture motion controls like flip to mute, two point volume adjustment, three point screenshot and tap to lock are some distinguishing features of the phone."
            ],
            "Display and Design:": [
                "It has a 5 inch LCD touchscreen HD IPS display with 1280 x 720 pixels resolution and 294PPI pixel density. It has a dimension of 141 x 70 x 7.3 mm and its weight is 134.5 grams. It is available in Rose Gold colour. Water 11 comes with a sturdy metallic frame, well-rounded bezel, a smooth and trendy design and broad viewing angles."
            ],
            "Hardware and Features:": [
                "This dual SIM devices comes with 1.3GHz quad-core MediaTek MT6735A processor, 3GB RAM, Mali-T720 MP2 graphics and Android 6.0 Marshmallow Operating System. GPS, ambient light sensor, FM radio, accelerometer, proximity sensor are available."
            ],
            "Camera and Storage:": [
                "Water 11 is equipped with 13MP rear and 5MP front camera with LED flash. Camera features include auto-scene detection, auto-focus, multi angle view mode, smile shot, video snapshot, face detection and gesture capture. Users can record Full HD Videos at 1080p. It has an internal storage of 16GB that can be expanded up to 32GB using a micro SD card."
            ],
            "Battery and Connectivity:": [
                "It is equipped with 2100mAh removable Li-Po battery that provides a talk time of nearly 7 hours on 4G networks and standby time of nearly 300 hours, music time of 18 hours nearly and up to 5 hours of video playback time. Connectivity options include 3G, 4G LTE (India Compatible), 2G, Wi-Fi 802.11 b/g/n, Bluetooth, VoLTE."
            ],
            "Competition:": [
                "Water 11 can face direct competition from Micromax Canvas Nitro 4G E455 as both are available at same price range but Water 11 has better OS and many innovative features."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lava-a59": {
        "text": {
            "Introduction:": [
                "Lava A59 is a dual SIM device that was launched in May 2016. Video PIP feature to shrink the video, slim and modern design, smart gestures and front LED flash are its major highlights."
            ],
            "Display and Design:": [
                "It comes with a 4.5 inch LCD FWVGA TFT display, 16M colours, and 854 x 480 pixels resolution and 218PPI pixel density. It has a dimension of 134 x 66 x 9.3 mm, 63.1% of screen to body ratio and weighs 140 grams. It is available in Black and White colours."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with a 1.3GHz quad-core processor, 512MB RAM and Android 5.1 Lollipop Operating System. Vibration on call connection, sound recorder, auto call recording, accelerometer and flip to mute features are available. FM radio and GPS are in-built. Audio and video playback option is available."
            ],
            "Camera and Storage:": [
                "This dual SIM device comes with a 5MP rear and 0.3MP VGA front camera with autofocus and dual LED flash. HDR, geotagging, digital zoom, photo timer, grid, panorama features are available. Rear camera has a resolution of 2592 x 1944 pixels and front camera has a resolution of 640 x 480 pixels. It has an internal storage of 4GB that can be expanded up to 32GB with the help of a micro SD card."
            ],
            "Battery and Connectivity:": [
                "Lava A59 is loaded with a 1750mAh Li-ion removable battery that provides the users with a music playback time of 32 hours in earphone mode and 19 hours in speaker mode. Users can enjoy connectivity through 3G, tethering, 2G, GPRS, EDGE, Wi-Fi 802.11 b/g/n, and Bluetooth."
            ],
            "Competition:": [
                "Alternatives to Lava A59 include Karbonn A6 as these are available in similar price range but features somewhat differ. Lava A59 has bigger screen size than others."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lyf-wind-7": {
        "text": {
            "Introduction:": [
                "LYF Wind 7 was launched in August 2016. The phone has some distinguished features like Video Pop-up, USB on-the-go support and image enhancer."
            ],
            "Display and Design": [
                ":",
                "LYF Wind 7 comes with a 5 inch LCD HD IPS capacitive display, a resolution of 1280 x 720 pixels and pixel density of 294PPI. It has a dimension of 143.5 x 72 x 8.7 mm and it weighs 156 grams. It is available in White, Blue and Black colors. Stylish matte finish, screen protection with Asahi Dragontrail Glass, 5 point multi touch and gesture control feature are its major highlights."
            ],
            "Hardware and Features:": [
                "This dual SIM device comes with 1.3GHz quad-core Qualcomm Snapdragon 210 processor, 2GB RAM and Android 5.1 Lollipop operating system. It has a Video Pop-up feature that enables the users to access apps, do tasks and watch a video simultaneously. Users can access and transfer the media files between the device and outside storage with the help of USB on-the-go support. Proximity sensor, ambient light sensor, accelerometer, and gyroscope are in-built. GPS and FM are also available."
            ],
            "Camera and Storage:": [
                "This dual SIM device comes with an 8MP rear camera having autofocus and LED flash and 5MP front camera. Facility of HD video recording at 720p is available. Panorama, image enhancer, HDR and face detection facilities are available. It has an internal storage of 16GB that can be expanded up to 128GB by using micro SD card."
            ],
            "Battery and connectivity:": [
                "LYF Wind 7 has a 2250mAh removable battery that provides 9 hours of talk time on 4G networks and video playback time of 5 hours. Users can enjoy connectivity through Bluetooth, 2G, 4G LTE (India Compatible), 3G, Wi-Fi and VoLTE."
            ],
            "Overview": [
                "LYF Wind 7 can face direct competition from Lenovo Vibe K5,Samsung Galaxy J3 andCoolpad Note 3 Lite as these are available in similar price range with somewhat similar features except a few variations in internal storage, processor speed, storage expandability and rear camera pixels."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/micromax-bolt-selfie-q424": {
        "text": {
            "Introduction:": [
                "Micromax Bolt Selfie Q424 is a dual SIM device that was launched in May 2016. Camera with face beauty mode and gesture capture, good configuration and 4G support are its major highlights."
            ],
            "Display and Design:": [
                "Micromax Bolt Selfie Q424 comes with a 4.5 inch LCD touchscreen FWVGA IPS display, 217.7PPI pixel density, 16M colours and 854 x 480 pixels resolution.  It is available in White and Champagne colours.",
                "Hardware and Features:",
                "This dual SIM device is loaded with MediaTek MT6735 processor, 1GB RAM, Android 5.1 Lollipop Operating System and Mali-T720 graphics. Gravity sensor, light sensor and proximity sensors are in-built. Pre-installed applications include Scandid, Indus, App Bazaar, App center, Ixigo cabs, Amazon shopping, Clean master, Hike, Music by Gaana, and CM security Opera mini, M!live, Quikr, Snapdeal, Travel, CM Locks and Wallet. Pre-installed games are Temple run paradise and Arjun prince of Bali. It supports MP4, 3GPP and 3GP video formats and MP3, MID, AMR, AAC and WAV audio formats.",
                "Camera and Storage:",
                "Micromax Bolt Selfie Q424 is equipped with 5MP AF rear and 5MP FF front camera with LED flash, autofocus and digital zoom. It has an internal memory of 8GB that can be expanded up to 32GB with a micro SD card.",
                "Battery and Connectivity:",
                "This dual SIM device has 1750mAh Li-Po removable battery that provides a talk time of up to 18 hours and stand by time of up to 260 hours. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, 2G, Wi-Fi and Bluetooth.",
                "Competition:",
                "Micromax Bolt Selfie Q424 faces competition from Yu Yunique Plus and Samsung Z2 Tizen. Both of these have faster processor and lower front camera than Bolt Selfie Q424. Samsung Z2 has smaller screen and lower battery capacity than Bolt Selfie Q424 whereas Yu Yunique Plus has bigger screen and higher battery capacity than Bolt Selfie Q424. "
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/itel-it1511": {
        "text": {
            "Introduction:": [
                "Itel It1511 is a dual SIM device that was launched in June 2016. Oncell display, 5 point touch support, capacitive touchscreen, excellent faux leather frame, metallic finish and 4G support are its major highlights."
            ],
            "Display and Design:": [
                "Itel It1511 is equipped with 5 inch HD touchscreen TFT IPS display, 1280 x 720 pixels resolution and 294PPI pixel density. It has a dimension of 138.5 x 69.5 x 9.8 mm and weight of 155 grams. It is available in 2 colours including champagne Gold and Black."
            ],
            "Hardware and Features:": [
                "This dual SIM device comes with 1GHz 64 bit quad-core MediaTek MT6735P processor, 1GB RAM, Mali-T720 for graphics and Android 6.1 Marshmallow operating system. G sensor, light sensor and proximity sensor are in-built."
            ],
            "Camera and Storage:": [
                "It comes with 8MP rear and 2MP front camera with dual flash. Geotagging and autofocus features are available. This dual SIM device has an internal storage of 8GB that can be expanded up to 64GB with a micro SD card.",
                "Battery and Connectivity:",
                "Itel It1511 is loaded with a removable Li-Po battery of 2500mAh that lets the users enjoy a talk time of up to 20 hours in 2G network and up to 13 hours in 3G network. The users can get a standby time of nearly 308 hours. Users can enjoy connectivity through Wi-Fi 802.11a/b/g/n, Bluetooth BT 4.0, GSM 900/1800/1900 MHz, EDGE, GPS, AGPS, OTG and LTE.",
                "Competition:",
                "Itel It1511 faces competition from slightly higher priced mobile phones like Coolpad Note 3 Lite and Swipe Elite Plus. However, when considering features, Coolpad Note 3 Lite has better rear and front camera and bigger RAM than Itel It1511. Also, Swipe Elite Plus has better camera, higher capacity and RAM than Itel It1511."
            ]
        },
        "Pros": [],
        "Cons": []
    }
}