{
    "https://pricebaba.com/mobile/apple-iphone-8-plus-256gb": {
        "text": {},
        "Pros": [
            "Excellent performance",
            "Good set of cameras on both sides",
            "Has support for wireless and fast charging"
        ],
        "Cons": [
            "Lacks a dual-rear camera setup",
            "Dated design",
            "Fast charger doesn't come bundled"
        ]
    },
    "https://pricebaba.com/mobile/asus-zenfone-3-deluxe-256gb": {
        "text": {
            "Overview": [
                "The ZenFone 3 Deluxe is company’s first smartphone to be powered by the latest Snapdragon 821 processor. Currently, there are only two other smartphones are available in India which are powered by this processor i.e OnePlus 3T and Google Pixel. However, ZenFone 3 Deluxe is available in two variants – one with 64GB of inbuilt storage and powered by Snapdragon 820 whereas the higher variant comes with 256GB of inbuilt storage and powered by Snapdragon 821. Both the variants feature a whopping 6GB of RAM."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-one-mini": {
        "text": {
            "Overview": [
                "The HTC One mini is what HTC claims to be, the miniaturised version of the HTC One, without too much compromise. On the exterior, it sure does seem so  as the One mini retains the same unibody aluminum enclosure that people love on the HTC One. The screen is smaller at 4.3-inches, thereby reducing the width of the handset and to make one-handed operation easier. The resolution is dropped down from Full HD to 1280 x 720 pixels, but owing to the smaller screen size, the handset still has a pretty sharp screen. The chipset is also a dual-core Snapdragon 400 running at 1.4GHz, unlike the quad-core chip powering the big brother. The RAM is halved to 1GB, internal memory too is cut by half to 16GB, also without any microSD card slot for expansion.",
                "The HTC One mini has high-speed Internet connectivity in the form of 4G LTE support, along with WiFi and 3G. Missing in the connectivity department are NFC and the Infrared port, which are available on the One. In the camera department, the One mini retains the 4 UltraPixel camera of its sibling, but loses the Optical Image Stabilization. Nonetheless, it can record 1080p HD videos at a smooth frame rate. There's a 1.6MP front-facing camera for video-calls too. The One mini has a smaller 1800 mAh battery, but considering the comparatively lower resolution screen and chipset, it should hopefully suffice."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-galaxy-golden-dual-flip": {
        "text": {
            "Overview": [
                "The Samsung Galaxy Golden is an Android-based smartphone with a flip form factor that's almost not to be seen these days. But the word 'Golden' in the name indicates the golden finish on the sides of the phone. It fuses two similarly sized 3.7-inch Super AMOLED displays back-to-back with a traditional numeric keypad. They have a reasonable 800 x 480 pixel resolution, and thanks to a 'hidden receiver', one can make calls even with the flip closed. Being a touchscreen phone, we also assume the phone would be entirely operational without having to open the flip. Samsung has created the flip to cater to the niche audience who misses the form factor and also prefers using buttons while dialling a phone number. Other than this, it's pretty much a mid-range smartphone on the inside  a dual-core 1.7GHz Snapdragon 400 chipset, 1.5GB RAM, 16GB internal storage.",
                "At the back you've got an 8 megapixel shooter and a 1.9MP cam for video calls/selfies. The 1820 mAh battery inside sounds a little less given the mid-range specs; but looking at the relatively low resolution display, hopefully the phone gets by the entire day on a single charge. Samsung is targeting the premium audience for this phone; with a price tag of Rs. 51,900 at launch."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-one-m10": {
        "text": {
            "Overview": [
                "Since the time immemorial, HTC has been known to make beautiful phones. Even before the HTC M7, which is looked upon as the trendsetter as far as the modern day smartphone design goes, the likes of HTC Tilt Pro 2, Desire or even the HTC Desire HD were finely built phones. After the HTC One M9, what had been widely reported as a failure, the HTC 10 has been seen as a sort of a comeback by HTC in the game. The phone brings the now synonymous with HTC, a metallic unibody design with chamfered edges. The other hardware features of the phone includes:"
            ],
            "Alternatives": [
                "Samsung Galaxy S7 ",
                "LG G5",
                "Xiaomi Mi5",
                "Frequently Asked Questions (FAQs) about the HTC 10."
            ],
            "1. Does it feature a fingerprint sensor?": [
                "Ans:",
                "2. Does it support OTG?",
                "3. Does the phone have a Hybrid SIM slot?",
                ""
            ],
            "6. What’s the PPI of the display?": [
                "Ans: ",
                "7. Will this get further software updates of Android? \nAns: It comes with Android 6.0 Marshmallow and will receive the Android 7.0 Nougat update in December 2016.\n\n8. What type or charging connector do I need? \nAns: It sports a USB Type-C charging connector."
            ]
        },
        "Pros": [
            "Beautiful design and build quality",
            "HTC has cut down on a ton of bloatware",
            "Very well calibrated display. Colors look natural and have a good punch",
            "First smartphone to come with OIS for front facing camera",
            "First Android phone to support AirPlay out of the box"
        ],
        "Cons": [
            "No BoomSound",
            "No wireless charging support",
            "Camera is not flagship quality",
            "Phone can feel a little slippery"
        ]
    },
    "https://pricebaba.com/mobile/vivo-xplay5-elite": {
        "text": {
            "Introduction:": [
                "The Vivo Xplay5 Elite, from Vivo Electronics Corp, was launched in March 2016. It is a dual SIM smartphone, which supports the 4G band on both the SIMs, high speed latest processor and has a very largest internal storage in the comparative price range of smart phones."
            ],
            "Display and Design:": [
                "The Vivo has a curved QHD display with a screen size of 5.43 inch. It has a touchscreen resolution of 1440 x 2560 pixels. The gadget measures 153.50 x 76.20 x 7.59 mm and weighs 167.80 grams. It is available in Gold color."
            ],
            "Hardware and Features:": [
                "The Vivo Elite has a strong 2.15GHz quad-core processor that is of Qualcomm Snapdragon 820 make. It has an Android 6.0 OS. It has a proximity sensor, accelerometer, ambient light sensor and gyroscope. It also has a Funtouch OS 2.6 which is a unique feature giving a smooth and fluid experience with customization of its OS."
            ],
            "Camera and Storage:": [
                "It is equipped with a 16MP rear camera and a flash. It has an 8MP front camera that allows users to click selfies. This dual SIM smartphone has a vast internal storage capacity of 128GB, is not expandable and has a 6GB RAM."
            ],
            "Battery and Connectivity:": [
                "The Vivo Xplay5 Elite has a removable 3600mAh battery. It offers Wi-Fi connectivity, with 802.11 a/b/g/n/ac and GPS navigation. Both SIMs support 4G services of band 40 in India."
            ],
            "Competition:": [
                "The Vivo Elite can be compared to the"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/vivo-xplay6": {
        "text": {
            "Overview": [
                "The Vivo Xplay 6 will likely be the flagship offering and the internals are definitely top spec. It features a Quad HD resolution screen and is powered by the Snapdragon 821 processor which is also powering the Pixel smartphones. The same chip is expected to power the upcoming OnePlus 3T as well."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/oneplus-6-256gb": {
        "text": {
            "Overview": [
                "OnePlus has launched it’s next level flagship phone the OnePlus 6. The phone comes with improvements in certain areas as compared to its predecessor. Let’s find out what this new device offers out of the box:"
            ],
            "Display & Design:": [
                "Beginning with the display the OnePlus 6 rocks a large 6.28-inch AMOLED  bezel-less display. It bears a Full HD+ resolution of 2280 x 1080 pixels which translates to a 402PPI pixel density producing a sharp and crisp display. Design-wise, the OnePlus 6 looks different than all of its previous versions. This is due to the notch located on the top of display. The phone rocks an all glass body. A Corning Gorilla Glass is fitted on the top of the screen as well as the back to ensure protection against accidental damage & scratches. There is a USB Type-C connector for charging and transferring data. The phone retains a 3.5 mm headphone jack for connecting any audio accessories. On the flip side, the dual rear cameras are now vertically aligned along with the fingerprint sensor mounted below. Both are located in the middle. "
            ],
            "Camera:": [
                "In the photography department, the OnePlus 6 is not much different than the previous OnePlus 5T. It sports a dual rear camera comprising of a 16MP primary sensor assisted by a 20MP secondary sensor. It has an aperture of f/1.7 and is accompanied by a dual LED flash for better pictures in low light. The primary rear camera now offers Optical Image Stabilisation (OIS) along with Electronic Image Stabilisation (EIS). Upfront, there is a 16MP snapper with f/2.0 aperture for clicking selfies. The rear camera is capable of recording 4k videos. "
            ],
            "Performance, Storage & OS:": [
                "On the performance front, the OnePlus 6 stays up to its tagline ‘The speed you need’. Under the hood, it houses a 2.8GHz Qualcomm’s flagship Snapdragon 845 octa-core chipset. It is coupled with 8GB RAM and and Adreno 630 graphics processor onboard. The aforementioned hardware ensures seamless multitasking and lag-free gaming performance. As for storage, this device offers 128GB internal memory. It can’t be expanded as it lacks a microSD card slot. Like all the OnePlus phones, this one runs on custom Oxygen OS as well, it is layered on the top of Android 8.0 Oreo OS. OnePlus has added a feature where you can hide the notch if you don’t like it."
            ],
            "Battery & Connectivity:": [
                "The OnePlus 6 is powered by a 3300 mAh non-removable battery which is the same as seen on OnePlus 5T. There is support for fast charging on the phone. It functions as a dual SIM smartphone and supports Nano SIM cards. For networking, all the basic connectivity options like 4G LTE, 3G, 2G, WiFi, Bluetooth, NFC and VoLTE are included. "
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-galaxy-note-iii-note-3-n9005": {
        "text": {
            "Overview": [
                "The Galaxy Note 3 is the 2013 iteration of the highly popular 'Note' series of Phablets pioneered by Samsung. It is a successor to the Note 2; and brings evolutionary changes to the table. Starting with the dimensions, it has the same footprint but is a millimeter thinner and noticeably lighter. The back of the device has a stitched leather finish, which is unique. But despite the same footprint, the Note 3 manages to fit in a slightly larger 5.7-inch display. The resolution is now bumped up to 1920 x 1080 pixels, a.k.a Full HD. The screen is of the Super AMOLED variety. The processor is bumped up to a Quad-core 2.3GHz (LTE) or 1.9GHz (3G) depending upon the variant your country has. In India, the chipset will mostly be the latter, which has two separate quad-core chips that switch depending upon usage. The RAM is also upped to 3GB, which possibly is the highest in a smartphone today. Internal memory starts at a capacious 32GB, with a microSD card slot for further expansion. All possible forms of modern-day networking supports are available  LTE, 3G, WiFi, Bluetooth 4.0, NFC etc. Speaking of connectivity, the Note 3 is also the first phone to feature USB 3.0 support, which will enable high-speed data transfers from computer to phone.",
                "In the camera department, it gets the 13 megapixel sensor like the Galaxy S4, but yet another never-before-seen feature is the support for 4K resolution recording. Unfortunately, only the LTE version of the Note 3 has this feature; the ones sold in India, that are powered by Samsung's Exynos processor, can shoot only up to 1080p HD. The front-facing 2MP camera can do 1080p HD recording too. There are a plethora of software features that Samsung has added to the Note 3 that enhances the active stylus functionality we've experienced with the previous Note handsets (watch the video above to check them out). Powering all these features is a slightly larger 3200 mAh battery inside."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/oneplus-6t-mclaren-edition": {
        "text": {
            "Overview": [
                "The Oneplus 6T McLaren Edition is an upgrade to the previously launched OnePlus 6T in Nov 2018. The device comes with improvements in a few aspects. Let’s delve into the technical specifications below:"
            ],
            "Display & Design: ": [
                "The Oneplus 6T McLaren Edition sports the same 6.41-inch optic AMOLED display as seen on its predecessor. The display translates to 402 PPI pixel density producing crisp and bright output. A Corning Gorilla Glass 6 is fitted on the top for protection against accidental damage and scratches. Design-wise, the 6T features a tiny waterdrop notch on the top of the display. The front and rear sides are flanked by glass panels that give a premium look. The device has an in-display fingerprint scanner instead of a physical scanner mounted on the rear. It is IP53 rated dust and splash resistant. "
            ],
            "Camera:": [
                "In the photography department, the OnePlus 6T is equipped with a vertical dual camera setup comprising of 16MP primary and 20MP secondary camera. Both feature a Sony sensor with f/1.7 aperture. Upfront, there is a 16MP shooter with f/2.0 for clicking selfies. The camera features EIS and OIS for clicking better pictures. OnePlus has added various camera features in the software like HDR, ISO, white balance and Bokeh mode. The device offers 4K video recording. "
            ],
            "Performance, Storage & OS:": [
                "In terms of performance, the 6T is quite similar to its predecessor. The device is powered by a Snapdragon 845 processor. It is coupled with 10GB RAM and Adreno 630 GPU onboard. The device offers 256GB internal memory without support for SDcard slot for further expansion. On the software front, the Oneplut 6T McLaren Edition runs on the latest Android 9.0 Pie based Oxygen OS. "
            ],
            "Battery & Connectivity:": [
                "The Oneplus 6T McLaren Edition is fitted with a 3,700 mAh battery more than the OnePlus 6. It supports fast charging capabilities. The device has a USB Type-C port for charging and headphone jack for connecting audio accessories. Connectivity-wise, all the basic options like 4G LTE, 3G, 2G, WiFi, Bluetooth and NFC are included. "
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/sony-xperia-z3-compact": {
        "text": {
            "Overview": [
                "Sony is known to make phones with good build quality and great designs. The Sony Z3 Compact is a successor to the Z1 Compact as the Z2 never had a mini version. Somewhere Sony is the company that has made better compact phones than others. The phone has a 4.6inches display as compared to the 4.3inches one on the Z1 compact but still has the same resolution of 1280x720 pixels which takes the pixel density down to 320PPI.",
                "The other upgrade is that it comes with a Snapdragon 801 unlike the Snapdragon 800 in the Z1 Compact. It has a bigger battery ie. 2600mAh but somehow still manages to be lighter than its predecessor. The phone comes with 2GB RAM and memory can be expanded upto 128GB using a microSD card. When it comes to the camera, this phone like other Sonys Z series has aced this feature. It has a 20.7MP rear camera which has features like panorama, geo-tagging, touch focus, face and smile recognition,etc. The phone will be available in four different colours and will directly compete with the HTC One Mini and the Samsung Galaxy S5 Mini."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/oneplus-5-8gb-128gb": {
        "text": {},
        "Pros": [
            "Blazing fast performance",
            "Dash charge ensures very fast charging",
            "Simple and bloat-free operating system",
            "Quick and accurate fingerprint sensor"
        ],
        "Cons": [
            "Lacks water resistance",
            "No Optical Image Stabilization (OIS)",
            "Dual Camera setup could have been better"
        ]
    },
    "https://pricebaba.com/mobile/nokia-lumia-930": {
        "text": {
            "Overview": [
                "The Nokia Lumia 930 is the flagship that was announced with Microsofts huge Windows Phone 8.1 update. This phone has a fair number of upgrades from its predecessor or sorts, the Lumia 925. In fact, it is a smaller version of the high-end Lumia 1520 phablet. The Lumia 930 sports a 5.0-inch 1920 x 1080 pixel, which is bigger and more pixel dense than the Lumia 925. The internals have also been beefed up  a Qualcomm Snapdragon 800 quad-core 2.2GHz chip now roars away, with 2GB of RAM and 32GB of internal storage (theres no microSD card slot, but this much should be sufficient for most).",
                "The camera system is also bumped up to a 20MP rear sensor with optical image stabilization and a dual-LED flash. It can also capture 1080p HD videos with stereo sound. Theres a typical 1.2MP front-facing camera, which in todays day and age seems inadequate for taking high-quality selfies. It also has built-in Wireless charging that was left out in the Lumia 925. All this high-end hardware is powered by a 2420mAh battery."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-radar": {
        "text": {
            "Overview": [
                "The HTC Radar was launched in October 2011. It runs on Windows Phone 7.5 (Mango) platform. It has a 3.8 inch capacitive touch screen. It has 512MB RAM, and 8GB of internal memory, a 5MP rear camera and a VGA secondary camera that supports HD video recording. Cloud services & social networks like Facebook, Twitter, Skydrive and Windows Live are integrated. It also supports GPS and provides access to Bing Maps."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/sony-xperia-z2": {
        "text": {
            "Overview": [
                "The Sony XPERIA Z1 was criticised for having a mediocre display for a high-end smartphone. This is addressed in the XPERIA Z2, which has a noticeably better display fitting to its stature of a flagship phone. It's still the same 1080p resolution on a slightly larger 5.2-inch display size. It is powered by the latest Snapdragon 801 quad-core 2.3GHz chip much like the Samsung Galaxy S5. But comes with an ampler 3GB of RAM (the Z1 had 2GB).",
                "It still has the 20.7MP rear camera that Sony's really proud of, and now it does 4K video recording too. Also, like the iPhone 5s the phone can record slo-mo video at 120fps. To top it off, it now has stereo speakers too. Also, the XPERIA Z2 is still water/dust resistant like its predecessors. The battery size is also bumped a little to 3200mAh. All in all, the XPERIA Z2 keeps all the good things about the Z1, while adding some much-needed improvements and feature-additions to keep the lineup up to date with modern times."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/micromax-canvas-fun-a76": {
        "text": {
            "Overview": [
                "The Micromax Canvas Fun A76 is similar to the Canvas Fun A74 which also sells as part of the colourful 'Fun' series of handsets from the Indian phone maker. It comes in the same three youthful shades  Red, Black and Blue. The A76 has a bigger 5-inch screen, but with the same 854 x 480 pixels, which in effect would reduce the pixel density. Interestingly, the processor is also a tad slower at 1.2GHz as compared to 1.3GHz on the A74. Rest of the details are about the same  4GB internal memory, 512MB RAM, a 5 megapixel fixed focus camera. One thing substantially bigger on the A76, other than its display, is the 2000mAh rated battery (the A74 has a 1500mAh one). Connectivity options include WiFi, 3G and Bluetooth 2.0. It runs Android 4.2 Jelly Bean out of the box."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-one-dual-sim": {
        "text": {
            "Overview": [
                "The HTC One Dual SIM, as the name suggests, is the variant that supports two SIM cards. It is the flagship model from the Taiwanese company for the year 2013. This handset encompasses HTC's best effort  and therefore the Matrix-inspired name, \"The One\". It's a stunning handset to look at, with its unibody aluminium body. The display is a 4.7-inch, Super LCD3 type with 1920 x 1080 resolution which translates to a whopping 496 PPI. Above and below that brilliant display are stereo speakers that belt out loud output with good clarity. Its more than adequately powered by the quad-core Qualcomm Snapdragon 600 chipset and an ample 2GB RAM. It comes in 32GB and 64GB capacities. The phone supports 4G LTE as well as WiFi's latest standard; 802.11ac. In the camera department, HTC's doing things differently. Enter UltraPixel  the sensor at the back of the HTC One can shoot only 4 megapixels, but the size of individual pixels in the sensor is twice the size found in good camera-phones like the iPhone 5 or 808 PureView. This, coupled with OIS (Optical Image Stabilisation), should give better low-light photography than typical camera-phones. There's also a 2.1MP front-facing camera with HDR support. Lastly, a 2300 mAh battery fit into the casing powers this beast of a handset."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/oneplus-6-64gb": {
        "text": {
            "Overview": [
                "OnePlus has launched it’s next level flagship phone the OnePlus 6. The phone comes with improvements in certain areas as compared to its predecessor. Let’s find out what this new device offers out of the box:"
            ],
            "Display & Design:": [
                "Beginning with the display the OnePlus 6 rocks a large 6.28-inch AMOLED  bezel-less display. It bears a Full HD+ resolution of 2280 x 1080 pixels which translates to a 402PPI pixel density producing a sharp and crisp display. Design-wise, the OnePlus 6 looks different than all of its previous versions. This is due to the notch located on the top of display. The phone rocks an all glass body. A Corning Gorilla Glass is fitted on the top of the screen as well as the back to ensure protection against accidental damage & scratches. There is a USB Type-C connector for charging and transferring data. The phone retains a 3.5 mm headphone jack for connecting any audio accessories. On the flip side, the dual rear cameras are now vertically aligned along with the fingerprint sensor mounted below. Both are located in the middle. "
            ],
            "Camera:": [
                "In the photography department, the OnePlus 6 is not much different than the previous OnePlus 5T. It sports a dual rear camera comprising of a 16MP primary sensor assisted by a 20MP secondary sensor. It has an aperture of f/1.7 and is accompanied by a dual LED flash for better pictures in low light. The primary rear camera now offers Optical Image Stabilisation (OIS) along with Electronic Image Stabilisation (EIS). Upfront, there is a 16MP snapper with f/2.0 aperture for clicking selfies. The rear camera is capable of recording 4k videos. "
            ],
            "Performance, Storage & OS:": [
                "On the performance front, the OnePlus 6 stays up to its tagline ‘The speed you need’. Under the hood, it houses a 2.8GHz Qualcomm’s flagship Snapdragon 845 octa-core chipset. It is coupled with 8GB RAM and and Adreno 630 graphics processor onboard. The aforementioned hardware ensures seamless multitasking and lag-free gaming performance. As for storage, this device offers 128GB internal memory. It can’t be expanded as it lacks a microSD card slot. Like all the OnePlus phones, this one runs on custom Oxygen OS as well, it is layered on the top of Android 8.0 Oreo OS. OnePlus has added a feature where you can hide the notch if you don’t like it."
            ],
            "Battery & Connectivity:": [
                "The OnePlus 6 is powered by a 3300 mAh non-removable battery which is the same as seen on OnePlus 5T. There is support for fast charging on the phone. It functions as a dual SIM smartphone and supports Nano SIM cards. For networking, all the basic connectivity options like 4G LTE, 3G, 2G, WiFi, Bluetooth, NFC and VoLTE are included. "
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/xiaomi-mi-note-3": {
        "text": {
            "Overview": [
                "Xiaomi, the Chinese smartphone maker, launched the Mi Note 3. The Mi Note 3 is situated above the recently launched Mi A1(Mi 5X) and below the flagship for 2017, the Mi 6. As the unique selling points to this device, Xiaomi has touted its newly developed AI-based Beautify feature and facial recognition unlocking."
            ],
            "Design": [
                "On the design front, the Mi Note 3 features an ergonomic design owing to its 4-sided curved body that is made out of glass. The glass back is inscribed by 7-Series aluminium alloy. Up front, Xiaomi has integrated a fingerprint sensor on the front which also doubles up as a home button."
            ],
            "Display and Camera": [
                "The phone boasts of a 5.5-inch Full HD display that has a resolution of 1920 x 1080 pixels. The display features an IPS LCD panel and bears a pixel density of 403 PPI. For the shutterbugs, the Xiaomi Mi Note 3, packs in a dual camera setup at the rear comprising of a 12-megapixel sensor which is a wide-angle lens having an aperture of f/1.8 and 4-axis optical image stabilisation and a secondary 12-megapixel sensor which is a telephoto lens having an aperture of f/2.6. On the front, the phone features a 16-megapixel selfie camera that is equipped with the AI-based beauty feature. The front-facing camera is also capable of unlocking the phone thanks to improved facial recognition."
            ],
            "Performance, Battery, and Storage": [
                "In terms of performance, the Mi Note 3 is powered by a Snapdragon 660 SoC clocked at 2.2GHz. This processor configuration is coupled with 6 GB of RAM on all storage variations of the device. As far as internal memory is concerned, the Mi Note 3 will ship in two variants – 64GB and 128GB, however, the internal memory of this device cannot be expanded through a microSD card. To keep the smartphone up and running, the offering from Xiaomi also boasts of a hefty 3500mAh battery unit that should get you through your day with moderate use."
            ],
            "Connectivity": [
                "On the connectivity front, Xiaomi has included multiple 4G LTE bands so that the device doesn’t miss out on LTE connectivity, no matter the carrier you use. It also supports dual-band Wi-Fi 802.11c alongside Bluetooth v5.0 and a USB Type-C port located on the bottom. Unfortunately, the 3.5mm headphone jack has been dropped on this offering from Xiaomi."
            ],
            "SImilar smartphones worth checking out:": [
                "1. Xiaomi Mi A1",
                "2. Motorola Moto G5s Plus"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/blackberry-keyone": {
        "text": {
            "Overview": [
                "The Blackberry KEYone is the first smartphone to be unveiled ahead of the MWC event at Barcelona. It isn’t a surprise since it was displayed to the masses under its codename ‘Mercury’ at CES earlier this year. While we think that Mercury would’ve been a much cooler name to go with, the KEYone is definitely unique."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lg-optimus-g": {
        "text": {
            "Overview": [
                "The LG Optimus G E975 is almost an internal replica of the Nexus 4, also made by LG. Although visually they both have a different appearance, internal similarities start with the 4.7-inch 1280 x 768 pixel IPS display, the Qualcomm S4 Pro quad-core chip running at 1.5 GHz and the 2GB RAM. The Optimus G is better than the Nexus 4 in some respects though  it has twice the amount of storage (32GB internal vs. 16GB on the Nexus 4) and without a microSD card slot for expansion. It also boasts of a 13 megapixel camera sensor, where the Nexus 4 has an 8MP one. The Optimus G also has a similar powered 2100 mAh non-removable battery. With respect to software though, the Optimus G lags behind as it currently runs Android 4.1 Jelly Bean, which is two generations away from the latest 4.3 JB that the Nexus 4 runs on. Also, LG has done its own modifications to the interface; thereby not offering the vanilla stock Android UI of the Nexus 4."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/xiaomi-mi-note-pro": {
        "text": {
            "Overview": [
                "Xiaomi Mi Note Pro could be everything that the Xiaomi Mi Note had missed. Everything about the Mi Note Pro is grand.",
                "Lets see some of the features it has to offer:",
                "It is a phablet. It has a 5.7 inches Quad HD JDI display which puts it in the ring with reigning champion, the Note 4 with same numbers in the display category.",
                "Camera on the Mi Note Pro is 13MP with IMX 214 Sony Exmor R sensor for great picture quality. Thanks to OIS, the images will be decent even in low-lighting. The camera is capable of recording in 1080p.",
                "It runs not one but two beastly processors, the Snapdragon 810 clocked at 1.5GHz and 2GHz and graphics are taken care of by a an Adreno 430 GPU. All this makes it easy to be named a powerhouse.",
                "If that much of a processor power wasn't enough, this phone also comes with 4GB of RAM. You can multitask with this phone flawlessly without any lags or stutters.",
                "As for storage, there is no SD card slot. But this phone comes with an onboard storage of 64GB.",
                "Mi Note Pro will ship with Android Lollipop 5.0.1 out of the box on top of MiUi 6. MiUi seems to have fairly decent amount of useful tools that wont make it feel bloated in any way.",
                "This phone is also a Dual SIM device which is not the case with most high end phones.",
                "To back it all up, there is a 3090mAh battery that promises to give a 8 hour usage time."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-galaxy-a9": {
        "text": {
            "Introduction:": [
                "Samsung Galaxy A9 is a dual SIM device that was launched in December 2015. Good front camera, good battery capacity and large memory storage are its major highlights."
            ],
            "Display and Designs:": [
                "This dual SIM device comes with a 6 inch capacitive multi-touch AMOLED display, 1920 x 1080 pixels resolution, 16M colours and pixel density of 367PPI. It has a metallic body and it is available in 3 colours Pink, Gold and White. Its back panel is built with Corning Gorilla Glass 4. It has a dimension of 161.7 x 80.9 x 7.4 mm and it weighs 200 grams."
            ],
            "Hardware and Features:": [
                "Samsung Galaxy A9 is equipped with 1.8GHz octa-core Qualcomm Snapdragon 652 processor, Android 5.1.1 operating system that can be upgraded to Marshmallow and 3GB RAM. Adreno 510 is present for excellent graphics It comes with a fingerprint scanner that provides security. Proximity sensor, ambient light sensor, accelerometer and gyroscope are in-built. FM radio and GPS are available."
            ],
            "Camera and Storage:": [
                "It has a rear camera of 13MP and front camera of 8MP. Users can record full HD videos at 30fps. Optical image stabilization, geotagging, HDR, white balance presets, single LED flash, autofocus, ISO control, face detection and continuous shooting facilities are available. "
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is loaded with 4000mAh non-removable battery. Users can enjoy connectivity through Wi-Fi 802.11, 4G, 3G, GPRS, Bluetooth, Mobile Hotspot, USB port GPS, Glonass and NFC availability."
            ],
            "Competition:": [
                "This dual SIM device can face direct competition from"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/vivo-v20-2021-256gb": {
        "text": {
            "Overview": [
                "Vivo's mid-ranger dubbed Vivo V20 2021 256GB is one of the cheapest 5G devices of all time. Not just that but the smartphone also packs in a great value for money and some amazing specs for the price such as a beautiful AMOLED display, a huge 4000mAh battery, a great camera setup, and a lot more. The smartphone is powered by the Snapdragon 730 SoC."
            ],
            "Design and Display": [
                "The Vivo V20 2021 256GBboasts a 6.44 inch AMOLEDdisplay with a resolution of 1080 x 2400 pixelsand a high pixel density of 409ppi to fabricate rich and crisp visuals. The bezel-less display sports an immersive Waterdrop notch design along with an aspect ratio of 20:9 for enhanced viewing experience."
            ],
            "Cameras": [
                "The Vivo V20 2021 256GB houses a triple rear camera with a powerful 64MP wide-angle primary sensor, an 8MP wide-angle sensor, and a 2MP mono sensor with Dual-color LED flash support onboard. Coming to the front, the device features a powerful 44MP wide-angle selfie shooter. The camera arrives with features likeAuto Flash, Auto Focus, Bokeh Effect, Continuos Shooting, Exposure compensation, Face detection, Geo tagging, High Dynamic Range mode (HDR), ISO control, Touch to focus, White balance presets."
            ],
            "Battery and Performance": [
                "The Vivo V20 2021 256GB is baked with the Qualcomm Snapdragon 730 chipset coupled with an Adreno 618GPU. The device comes assembled with 8GB RAM paired with an internal storage capacity of 256 GB, which can be expanded upto a whopping 1TB. Fuelling the device is a huge 4000mAh Li-ion battery with fast charging support on board."
            ],
            "Software and Connectivity": [
                "Vivo V20 2021 256GB runs Funtouch OS UI on top of Android 11 out of the box. For the connectivity options, the smartphone supports features likedual sim VoLTE(Nano + Nano), Wi-Fi 802.11, ac/b/g/n/n 5GHz, GPS, and Bluetooth 5.1. Furthermore, the smartphone also packs in a 3.5mm headphone jack ,a USB Type-C port, and an on-screen fingerprint sensor as well."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-note-3-note-iii-64gb-n9000": {
        "text": {},
        "Pros": [
            "Excellent display clarity for users",
            "Comes with screen protection out of the box, which is a big plus",
            "Excellent back camera quality and experience for images and videos"
        ],
        "Cons": [
            "Average battery life for moderate to heavy phone users",
            "Screen size may be a bit much for some users due to palm-fit concerns"
        ]
    },
    "https://pricebaba.com/mobile/lenovo-vibe-z2-pro": {
        "text": {
            "Overview": [
                "The Vibe Z2 Pro is the latest flagship from Lenovo. The device has amazing specs for the price it is offered. It has a 6 inch display with a resolution of 2560x1440, thats Quad-HD resolution with a pixel density of 490PPI. The screen is pixel packed to look at and looks stunning. The device is powered by a Quad-core Qualcomm Snapdragon (MSM8974AC) 801 processor clocked at 2.5GHz, coupled with 3GB of RAM. The phone has 32GB of internal storage but sadly no microSD card support. It supports dual-SIM functionality.",
                "Apart from the huge display, it also packs in a huge 4000mAh battery unit that the company claims is good enough for 45 hours of talktime and 39 days on standby mode. It has a 16-megapixel rear camera with dual LED flash, while a 5-megapixel camera sits on the front with anti-distortion lens. The rear camera has OIS (optical image stabilization), 4K video recording and high-speed 120fps videos.",
                "The other important features you need to know is that it runs on Android 4.4 KitKat with UI on top of it called Vibe UI 2.0. The good guys at Lenovo have allowed an option to boot into stock Android mode, just in case you dont like Vibe UI. The phone comes pre-loaded apps like SHAREit, SYNCit, CLONEit, SNAPit Camera, SEEit Gallery, AccuWeather, UC Browser, Route 66 Navi+Maps, Evernote and Guvera Music."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-galaxy-s10": {
        "text": {
            "Overview": [
                "The Samsung Galaxy S10 is not released yet but is already deemed to be one of the best phones of 2019. It is Samsung’s next primary flagship. "
            ],
            "Design": [
                "The handset has a design similar to that of the Galaxy Note with tiny bezels around the screen. ",
                "The phone is said to have a ceramic back with both front and rear 3D sensors making it a powerhouse for Augmented Reality. "
            ],
            "Display": [
                "According to the renders released by Samsung, we now know that the phone will be available in three different screen sizes."
            ],
            "The screen is said to be 5.8 inches. ": [
                "It will have an aspect ratio of 19:9 and a resolution of 1440 x 3040 pixels. "
            ],
            "Camera": [
                "The screen has a cutout housing two cameras. ",
                "The phone is said to offer 8K vídeo recording at 30fps. ",
                "The highest end model of the phone is rumored to have 6 cameras- two on the front and four on the rear. It also comes with a front flash and supports features such as "
            ],
            "Chipset, Software, and Performance": [
                "Samsung revealed that the next generation Exynos 9820 chip would be powering the Samsung Galaxy S10. ",
                "The phone is expected to launch with the new Android 9.0 Pie operating software coupled with an updated version of the Bixby digital assistant. ",
                "It is expected to be Samsung’s most power efficient phone. ",
                "The new Mali-G76 GPU core processor is said to make the phone a smooth running one when it comes to handling games and apps. ",
                "Qualcomm has announced that the phone will be run by Snapdragon 855 chipset.  "
            ],
            "Communication": [
                "So far, it is known that the Samsung Galaxy S10 will not be 5G capable. "
            ],
            "Other Features": [
                "Price and Availability ",
                "The Samsung Galaxy S10 is said to launch in early 2019 with three different variants. They have been given the codenames Beyond 0, Beyond 1 and Beyond 2. ",
                "However, since the phone has not been released yet, the rumored variant of it could differ from the entire Galaxy S10 line. "
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lg-v30-plus": {
        "text": {
            "Overview": [
                "South Korean electronics giant LG has launched the LG V30 Plus that has all the features every user wants. Let’s take a detailed look at the device’s overview:"
            ],
            "Display & Design:": [
                "The LG V30+ boasts of a QHD+ OLED display with a 2880 x 1440 pixel resolution which yields a pixel density of 537 PPI. A Corning Gorilla Glass 5 is fitted on top of the screen for protection against accidental damage & scratches. Like most bezel less smartphones, there are no physical buttons on the front & the fingerprint scanner has been mounted on the back of the device. Design-wise, the V30+ sports a metallic body which feels sturdy, while the glass back prevents the phone from slipping from your hands. There is a USB Type-C connector along with a 3.5mm headphone jack. The V30+ is IP68-certified dust & water resistant. Sensors on the phone include accelerometer, proximity sensor, barometer, & gyroscope. It ships in two attractive colors ie. Black & Silver. "
            ],
            "Camera:": [
                "In the photography department, the V30+ is equipped with a dual rear camera system. It comprises of a primary 16MP camera with f/1.6 aperture lens for better low light photography. There is a secondary 13MP shooter with 120 degree wide angle lens & an f/1.9 aperture lens. The dual cameras are accompanied by an LED flash. There is also PDAF system that aids in quick focusing. Upfront there is a 5MP snapper for clicking selfies. The rear camera offers 4k video recording (2160p)."
            ],
            "Performance, Storage & OS:": [
                "Under the hood, the V30+ houses a powerful & power efficient Qualcomm Snapdragon 835 octa-core processor seen in most flagship smartphones today. It packs 4GB RAM along with Adreno 540 graphics processor onboard. The device offers massive 128GB internal storage which can be expanded up to 2TB via microSD card. It runs on Android 7.1 Nougat out of the box and might get an update to Android 8.0 Oreo soon."
            ],
            "Battery & Connectivity:": [
                "The LG V30+ is powered by a 3300 mAh non-removable battery. The phone supports wireless charging & features Qualcomm’s Quick Charge 3.0 technology. It functions as a dual sim smartphone with support for nano sim cards. Connectivity options on the phone include GPS, 4G LTE, 3G, 2G, WiFi, Bluetooth, NFC & VoLTE."
            ],
            "Frequently Asked Questions About LG V30+:": [
                "1. Will this phone work with Reliance Jio network?",
                "Ans: Yes, you can use Reliance Jio on this phone as it supports VoLTE connectivity.",
                "2. How is the camera for selfies? ",
                "Ans: The device features a 5MP front camera which captures good quality selfies.",
                "3. What type of charging connector do I need? ",
                "Ans: The V30+ supports latest USB Type-C connectorfor charging & data syncing.",
                "4.What comes in the box?",
                "Ans: With LG V30+ you will get charger & a separate cable, earphone, sim ejector tool & a user manual."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/vivo-x7-plus": {
        "text": {
            "Introduction:": [
                "Vivo Electronics Corp. is a phone brand which launched Vivo X7 Plus in India in June 2016. The phone comes with latest octa-core processor with 4GB RAM that gives lightning speed. It is the only phone in the range which is providing a 16MP front camera."
            ],
            "Display and Design:": [
                "Vivo X7 has a 5.7 inch Super AMOLED capacitive touchscreen, provides 16M colors with resolution of 1080 x 1920 pixels having a pixel density of 386PPI. This phone weighs around 183.5 grams. It is available in Gold and Rose Gold color variants. Its size dimensions are 158.9 x 78 x 7.5 mm."
            ],
            "Hardware & Features:": [
                "The Vivo X7 Plus smart phone is powered by a 1.8GHz octa-core Qualcomm Snapdragon 652 (MSM8976) with 4GB RAM capacity. The phone runs on Android 5.1 version (Lollipop). Internal storage of 64GB and cannot be extended and comes with inbuilt sensors like fingerprint sensor, gyroscope, proximity, ambient light, and accelerometer."
            ],
            "Camera & Storage:": [
                "The Vivo X7 Plus offers a primary camera of 16MP with f/2.0, phase detection autofocus, and LED flash on the rear side. The front camera of the phone provides 16MP at f/2.0 with LED flash."
            ],
            "Battery & Connectivity:": [
                "The Vivo X7 Plus has a 4000mAh Li-Ion non-removable battery and offers dual SIM facility in which both are Nano-SIM and support 3G/4G and comes with Bluetooth 4.0, Wi-Fi 802.11 b/g/n, FM, and USB support are present. "
            ],
            "Competition:": [
                "The other alternatives to this phone include Lenovo Vibe P1 Turbo and Lenovo"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-galaxy-k-zoom-sm-c111": {
        "text": {
            "Overview": [
                "The Samsung Galaxy K Zoom SM-C111 is a successor to the Samsung Galaxy S4 Zoom C1010. The K Zoom is a lovechild of a phone and camera. The phone has a 4.8 inches Super AMOLED 720p display which gives the viewer very good contrast and vivid colours. It has a Hexa-Core processor; with two Cortex-A15 based cores clocked at 1.7GHz and four Cortex-A7 cores at 1.3GHz. It comes with 2GB RAM. Memory is expandable upto 64GB and the phone comes pre-installed with AndroId 4.4 KitKat.",
                "Since this is a camera first phone later, the primary camera is of 20.7MP CMOS sensor. This is very similar to a point-and-shoot cameras. It records 1080ps videos and has both autofocus and xenon as well as an LED flash. Its got a manual focus ring as well and comes with 10x optical zoom. The phone is powered with a 2300mAh removable lithium-ion battery. All said and done, we can imagine these type of devices are a hard-sell, as it is rather bulky to use as a phone (at 200 grams and 16.6mm thickness). Also, people may ridicule you when they see a camera at the side of your face."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lg-optimus-vu": {
        "text": {
            "Overview": [
                "LG has entered into the competition of super-sized smartphones that are now becoming a latest trend. LGs Optimus Vu is a smartphone that has 5 inches display screen. This HD-IPS LCD capacitive touch screen gives a resolution of 768x1024 pixels. Optimus Vu is powered by a quad-core Nvidia Tegra 3 processor of 1.5GHz and runs on Android OS v4.0 Ice Cream Sandwich. This phone has an internal storage of 32GB and 1GB RAM. Another interesting part to the phone is the Stylus that LG provides with this handset. Called Rubberdium, this stylus helps functioning smoothly, although the stylus does not have a a holder on the phone. Data and connectivity features are enhanced in Optimus Vu by 2G, 3G networks, W-Fi, Bluetooth v4.0 with A2DP and a GPS-support. An 8MP camera can be found over the back of the phone and is assisted by an LED flash for low light shots. This comes with features like Geo-tagging, face detection, image stabilization and auto focus. The users get an image quality of 3264x2448 pixels and a video quality of 1080p at 30 fps. Optimus Vu also has a secondary front facing camera of 1.3MP for video calls. This phone uses a standard Li-ion Battery of 2100 mAh. Besides these, its other features include TouchWiz UI, pre-installed apps like Video Wiz and Smartworld, sensors like accelerometer, proximity and compass, Stereo FM with RDS, active noise cancellation, Voice Memo and predictive text input. LG Optimus Vu is available in black and white colours."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-desire-601": {
        "text": {
            "Overview": [
                "The HTC Desire 601 is a rather quick update, just a few months after the Desire 600. There are many things common amongst both the handsets  the 4.5-inch qHD (960 x 540 pixel) display, the stereo speakers, 1GB of RAM and 8GB internal storage. Dimensionally, the Desire 601 is just a tad thicker than the Desire 600, assumingly due to the larger 2100 mAh battery inside. A larger battery seems to be in place to keep the phone running longer on 4G LTE. Even 3G speeds are faster on the Desire 601  maxing out at 42 Mbps. The major complaint the Desire 600 had was the Qualcomm Snapdragon 200, a quad-core chip meant for inexpensive Android handsets. The Desire 601 fixes that with a Snapdragon 400 on-board, which is a dual-core chip but running at a faster 1.4GHz speed. This chipset also has a better Adreno 305 GPU. Certain things have been downsized though  the camera is dropped from 8MP to 5MP, the front-facing cam from 1.6MP to a VGA (0.3MP) one. But thankfully due to the faster GPU, the Desire 601 can record in Full HD 1080p."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lenovo-vibe-x-s960": {
        "text": {
            "Overview": [
                "The Lenovo Vibe X compliments the K900, which was the companys flagship Android smartphone. The K900 was a razor thin phone at just 6.9mm, and the Vibe X is just as thin. Also, it is about 40 grams lighter and due to the smaller 5-inch display, has gotten trimmed with respect to height and width too. This should make the phone easier to hold and use with one hand. While the display size has gone down by half an inch, the resolution remains the same 1920 x 1080 pixels, resulting in a high 441 PPI pixel density. The next aspect that is changed from the K900 is the chipset  while it was powered by a 2GHz Intel Atom chip, the Vibe X has a more traditional Mediatek 6589T 1.5GHz quad-core chip, found on most Indian phone makers flagship units.",
                "The 13 megapixel camera is retained, while the front-facing camera sensor is bumped up to 5MP. Rest of the features between the K900 and the Vibe X remain quite similar. One unfortunate fact is the battery, which is bumped down to 2000 mAh from 2500 mAh. We hope though that the different chipset offsets the lack of battery capacity and provides a fair uptime."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/vivo-v21-5g-256gb": {
        "text": {
            "Overview": [
                "Vivo's mid-ranger dubbed Vivo V21 5G 256GB is one of the cheapest 5G devices of all time. This 5G device also has the potential to be crowned as the next mid-range killer. Not just that but the smartphone packs in a great value for money and some amazing specs for the price such as a beautiful AMOLED display, a huge 4000mAh battery, a great camera setup, and a lot more. The smartphone will be powered by the MediaTek Dimensity 800U MT6853V SoC."
            ],
            "Design and Display": [
                "The Vivo V21 5G 256GBboasts a 6.44 inch AMOLEDdisplay with a resolution of 1080 x 2404 pixelsand a high pixel density of 409ppi to fabricate rich and crisp visuals. The bezel-less display sports an immersive Waterdrop notch design along with an aspect ratio of 20:9 and a refresh rate of 90Hz for enhanced viewing experience."
            ],
            "Cameras": [
                "The Vivo V21 5G 256GB houses a triple rear camera with a powerful 64MP wide-angle primary sensor, an 8MP wide-angle sensor, a 2MP macro sensor with LED flash support onboard. Coming to the front, the device features a powerful 44MP wide-angle selfie shooter with Dual LED flash support. The camera arrives with features likeArtificial Intelligence, Auto Flash, Auto Focus, Bokeh Effect, Continuos Shooting, Exposure compensation, Eye Autofocus, Face detection, Geo tagging, High Dynamic Range mode (HDR), ISO control, Optical image stabilization, Touch to focus, White balance presets."
            ],
            "Battery and Performance": [
                "The Vivo V21 5G 256GB is baked with the MediaTek Dimensity 800U MT6853V chipset coupled with a Mali-G57 MC3GPU. The device comes assembled with 8GB RAM paired with an internal storage capacity of 256GB, which can be expanded upto a whopping 1TB. Fuelling the device is a huge 4000mAh Li-ion battery with fast charging support on board."
            ],
            "Software and Connectivity": [
                "Vivo V21 5G 256GB runs Funtouch OS UI on top of Android 11 out of the box. For the connectivity options, the smartphone supports features like 5G, dual sim VoLTE(Nano + Nano(Hybrid)), Wi-Fi 802.11, a/ac/b/g/n, GPS, and Bluetooth 5.1. Furthermore, the smartphone packs in a USB Type-C port, and an on-screen fingerprint sensor as well."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/poco-f1-armoured-edition-128gb": {
        "text": {
            "Overview": [
                "Poco has now officially launched the Poco F1 Armoured Edition 128GB which turns out to be a budget smartphone that tries to deliver the absolute bang for the buck. The specifications make it quite clear that poco has made a great attemp to deliver way more for the price. The Poco F1 Armoured Edition 128GB has a large 4000mAh battery and a Qualcomm Snapdragon 845 chipset. The device also scores well in the display and cameras department."
            ],
            "Design and Display": [
                "The Poco F1 Armoured Edition 128GB features a 6.18 inch IPS LCD display with a resolution of 1080 x 2246 pixels and a pixel density of 403ppi. The display has a waterdrop notch with less bezels and an aspect ratio of 18.7:9.The device comes with added Corning Gorilla Glass to protect phone from any damage."
            ],
            "Cameras": [
                "The Poco F1 Armoured Edition 128GB has a dual camera system consisting of a 12MP primary sensor, and a 2MP sensor. For selfies, the device sports a 20MP camera sensor on the front. Features like Artificial Intelligence, Auto Flash, Auto Focus, Bokeh Effect, Continuos Shooting, Electronic Image Stabilization (EIS), Exmor-RS CMOS Sensor, Exposure compensation, Face detection, Geo tagging, High Dynamic Range mode (HDR), ISO control, Touch to focus, White balance presets are some of the many other that the camera supports."
            ],
            "Battery and Performance": [
                "The Poco F1 Armoured Edition 128GB is embedded with the Qualcomm Snapdragon 845 chip and a Adreno 630 GPU. The RAM and internal storage of the device stand at 6GB and 128GB respectively. The device also supports memory cards up to 256GB. Battery life with this device is not going to be an issue with the large 4000mAh Li-Polymer battery that it comes with."
            ],
            "Software and Connectivity": [
                "Poco F1 Armoured Edition 128GB runs MIUI on the top of Android 8.1 out of the box. The smartphone has a variety of connectivity options like dual SIM 4G(Nano + Nano(Hybrid)), Wi-Fi 802.11, a/ac/b/g/n, GPS,Radio and Bluetooth 5.0. Coming to ports selection, the device has a USB Type-C port , a 3.5mm headphone jack, and a rear-mounted fingerprint sensor placed on the side of the device."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/xiaomi-lanmi-x1": {
        "text": {
            "Overview": [
                "With its highly competitive pricing, Xiaomi has already conquered the online smartphone market in India. Now, the company is eyeing the offline market. Even though online players offer huge discounts and products with more value for money, it still comprises of only 30-35% of market share. The offline channels still rule the smartphone market in India by a great margin."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lg-optimus-3d-max-p725": {
        "text": {
            "Overview": [
                "Optimus 3D Max P725 is the second launch by LG in the 3D smartphones market. P725 3D is a slim phone with stylish and curved edges weighing 148 grams. The device converts the old 2D videos and photos into life like 3D, making the users relive their memories. It allows you to enjoy watching 3D videos without the 3D glasses or any other devices. This gives a great comfort, better readability and thus improving the overall display experience. The phone features tri-dual architecture - dual core processor, dual channel and dual memory. The phone has a speedy 1.2 GHz processor and is supported by 1 GB RAM, allowing your games and video applications to operate without any lags.",
                "The phone comes with a 5 mega-pixels camera which is capable of 720p high definition video recording. The camera unit is equipped with LED flash and even features options such as Geo-Tagging, Autofocus, Continuous Shot, Macro and face tracking. There is a secondary 0.3 megapixel front-facing camera also keeping up the dual-architecture used in the phone. The internal memory of 8GB can be expanded with the help of a micro SD card. It is powered by a 1520 mAh battery giving talk time of up to 8 hours."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-desire-820q-dual-sim": {
        "text": {
            "Overview": [
                "The HTC Desire 820q is the successor of the HTC Desire 816, the Desire 816 has been a hot seller for HTC and it aims to achieve similar results with the Desire 820q.",
                "The Desire 820q is powered by a run-of-the-mill 1.2GHz quad-core Snapdragon 400 processor unlike its 64-bit, octa-core Snapdragon 615 powered sibling -- the HTC Desire 820. The RAM is also halved at 1GB (the Desire 820 has 2GB), but we hope its good enough for average users. It has a 5.5 inch screen with a display resolution of 1280 x 720 pixels, same as the predecessor. The pixel density is 267PPI which is average.",
                "The Desire 820q runs on Android 4.4 Kitkat but it is expected to be updated to Android 5.0 Lollipop. The phone has a 13 megapixel primary camera which is capable of recording 1080p video at 30FPS and 720p video at 60FPS. It has a front facing 8 megapixel camera, the sensor should be capable of clicking some killer selfies. It has 16GB of internal memory which is expandable to 128GB using a MicroSD card slot. A 2600 mAh non removable Li-Po battery present should provide decent backup. This a Dual SIM device and accepts 2 Nano SIM cards."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/intex-aqua-i7": {
        "text": {
            "Overview": [
                "Intex Technologies, incepted in the year 1996 is an Indian Mobile, IT accessories and Consumer Durables Company. The Intel Aqua i7 was launched around September 2013. It has a 5 inch touch screen display and runs Android 4.2 Jelly Bean. It has a 1.3GHz quad-core processor coupled with 2GB of RAM. The primary camera is 13MP and the secondary one (front facing) is a 5MP one. It comes with 32GB internal storage which cannot be expanded further. The battery is of 2000mAh and is removable. Decent-sounding specs at its price. You could also look at the Micromax Canvas Knight A350."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/sony-xperia-s": {
        "text": {
            "Overview": [
                "With its sleek and elegant look, Xperia S comes as the next generation smart phone by Sony. It sports a 4.3 inches TFT capacitive display that sports a resolution of 720 by 1280 pixels. The LED backlit touch screen is covered with a scratch-resistant glass. The phone becomes user friendly with Timescape UI and supports Sony's Bravia Engine. Xperia S gives a internal storage of 32GB. This phone is powered by dual-core 1.5GHz processor and has a Qualcomm Snapdragon chipset. Xperia S runs on Android OS v2.3 Gingerbread and can be upgraded to v4.0 Ice-Cream Sandwich. Connectivity to internet is enhanced by GPRS and EDGE that comes under 2G, faster surfing through 3G networks and Wi-Fi for wireless. Bluetooth v2.1 with A2DP and USB support help in transmission of files.",
                "Sony Xperia S offers a 12MP camera with features like auto focus, LED flash, geo-tagging, touch focus, smile detection, image stabilization and video recording of 1080p at 30fps. This gives a high image resolution of 4000 by 3000 pixels. Its secondary front facing camera of 1.3MP complements video calls. This mobile phone comes equipped with a multi-format music and video player, has a 3D surround support and xLoud Audio Filter Technology. Its other features include GPS support, TV launcher, active noise cancellation, voice memo, predictive text input, WalkMan app, FM with RDS, Track ID music recognition and PlayStation. This phone runs on a standard Li-ion battery that sustains 8 hours 30 min of talk time and up to 420 hours in stand-by mode (for 3G). Xperia S is available in White, Black and Silver colours."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-galaxy-a52-8gb-ram": {
        "text": {
            "Overview": [
                "The much-awaited Samsung Galaxy A52 has finally been launched. This tells us that Samsung is finally amping up its smartphone game in the mid-range category. Samsung also offers the 8GB variant in case you want that extra memory to get things going. For the first time in a while, it feels like mid-range Samsung smartphones such as the Galaxy A52 are worth the money and deliver good value for the same. For instance, the Galaxy A52 packs in a 90Hz Super AMOLED display, a huge 4500mAh battery, superb cameras camera setup, a Snapdragon 720G chipset, and a lot more. It also comes with a fresh design that does look good"
            ],
            "Design and Display": [
                "The Samsung Galaxy A52 8GB boasts a 6.5 inch Super AMOLEDdisplay with a resolution of 1080 x 2400 pixelsand a high pixel density of 405ppi to fabricate rich visuals. The bezel-less display sports an immersive punch-hole design with an aspect ratio of 20:9 and a smooth refresh rate of 90Hz to deliver a better user experience. The device also comes with IP67 water resistance."
            ],
            "Cameras": [
                "The cameras on the Samsung Galaxy A52 8GB are just great. On the back, there's a quad-camera setup with a powerful 64MP wide-angle primary sensor, a 12MP wide-angle sensor, a 5MP macro sensor, and a 5MP depth sensor with an LED flash. Coming to the front, the device features a powerful 32MP wide-angle selfie shooter. The camera comes with features likeAuto Flash, Auto Focus, Bokeh Effect, Continuos Shooting, Exposure compensation, Face detection, Geo-tagging, High Dynamic Range mode (HDR), ISO control, Optical image stabilization, Touch to focus, White balance presets."
            ],
            "Battery and Performance": [
                "The Samsung Galaxy A52 8GB is baked with the Qualcomm Snapdragon 720G chipset clubbed with an Adreno 618GPU. The device comes assembled with 8GB of RAM and an internal storage capacity of 128 GB, which can again be expanded upto a whopping 1TB. The device is fuelled by a huge 4500mAh Li-ion battery with fast charging support on board."
            ],
            "Software and Connectivity": [
                "Samsung Galaxy A52 8GB runs One UI on the top ofAndroid 11 out of the box. Speaking of connectivity, the smartphone gets features likedual sim VoLTE(Nano + Nano(Hybrid)), Wi-Fi 802.11, a/ac/b/g/n/n 5GHz, GPS,NFC and Bluetooth 5.0. Adding more to it, we have a USB Type-C port, a 3.5mm headphone jack, and an on-screen fingerprint sensor."
            ]
        },
        "Pros": [
            "90Hz Super AMOLED display and a beautiful fresh design",
            "Superb cameras and 1TB expandable memory",
            "Good performance and value for money",
            "Huge 4500mAh battery with fast charging",
            "3.5mm headphone jack and on-screen fingerprint sensor"
        ],
        "Cons": [
            "Hybrid SIM tray",
            "Doesn't support 5G"
        ]
    },
    "https://pricebaba.com/mobile/oppo-a77": {
        "text": {
            "Overview": [
                "Oppo launched its latest selfie-focused smartphone dubbed the Oppo A77. It boasts of a 16-megapixel front-facing camera for selfies, which is also a selling point for the brand. It comes in two colours: Gold and Rose Gold."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/sony-xperia-zr": {
        "text": {
            "Overview": [
                "You could call the XPERIA ZR, an XPERIA SP on steroids, or maybe a toned-down XPERIA Z. The ZR has a similar 4.6 inch 1280 x 720 pixel display like the XPERIA SP, but is water and dust proof like the XPERIA Z. Sony also claims the screen to be \"shatter-proof\". There's a quad-core 1.5GHz Krait-based Snapdragon chip powering this phone, with an ample 2GB of RAM. There's 8GB internal storage and a microSD card slot for further expansion. A 13.1 megapixel camera dominates the back and a VGA front-facing camera lies up-front. The rear camera can record 1080p Full HD video at a smooth 30 frames per second and with HDR (High Dynamic Range) too. A 2300 mAh battery is expected to power all this powerful hardware. Certain variants of the XPERIA ZR also support LTE that enables the next gen high-speed internet access."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lenovo-zuk-edge": {
        "text": {},
        "Pros": [
            "Nearly bezel-less design looks astounding",
            "Back panel is exposed to 2.5D glass",
            "Takes about two hours to charge completely"
        ],
        "Cons": [
            "No microSD slot for memory expansion",
            "Not-so-good outdoor photography"
        ]
    },
    "https://pricebaba.com/mobile/gionee-gpad-g4": {
        "text": {
            "Overview": [
                "Gionee is a Chinese smartphone manufacturer who have joined the bandwagon of mobile companies to launch their business in India. The phone has a huge 5.7 inches display with the resolution of 1280x720 pixels taking the pixel density to 258 PPI. It is a dual SIM phone and comes with 1GB of RAM. The phone is powered by a 1.5GHz Cortex A7, quad core processor.",
                "It comes with 16GB internal memory, which cannot be further expanded. It has a 13 Megapixel camera at the back which records 1080p full HD video and a 5 Megapixel front camera for video calls, etc. The phone has a 3200 mAh battery, which is decent considering the huge display. One looking to buy this phone can also check out the Samsung Galaxy Prime 2 and the Xolo Play 8X ."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/panasonic-p51": {
        "text": {
            "Overview": [
                "Usually people used to associate Panasonic name with electrical appliance like TVs, refrigerator, air conditioners etc. With the explosion of the smartphone industry, this Japanese giant has come up a range of mobile handsets. Panasonic P51 falls in the upper mid-range category. Its got a 5 inch display making it breach into the highly popular phablet segment. The screen has a 1280 x 720 pixel resolution (better than Samsung Grand Duos which gives out 800 x 480 pixels) HD IPS screen and is protected by Asahis Dragontrail Glass which is supposed to give better protection than Gorilla glass. It is powered by 1.2GHz Cortex A7 quad-core processor. Its got 1GB RAM which is fair for its price range and has 4GB internal storage which can be expanded up to 32GB by microSD card.",
                "It runs Android JellyBean 4.2. Its a 8.5mm slim phone and due to the slimmer chassis its 8MP rear facing camera protrudes out a little. The camera has LED flash and autofocus feature and records HD videos at 1080p. Its got a 1.3MP secondary camera which is capable of recording videos at 720p. The Panasonic P51 is loaded with 2500mAh battery. Its a 3G enabled phone. Theres stylus also provided with this handset but we dont think that its an active stylus like the Samsung Note series as it kind of looks like a typical capacitive stylus which was provided with the Micromax Canvas Doodle."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-galaxy-sii-s2-plus-i9105": {
        "text": {
            "Overview": [
                "The Samsung Galaxy SII Plus is a visually identical twin to the original SII. It comes in different colour variants, but most people may not be able to identify between the two easily. It comes with the same 4.3-inch 800 x 480 Super AMOLED Plus display. The main difference in hardware lies internally, where instead of Samsung's own Exynos range of chipset, the SII Plus uses a Broadcom dual-core 1.2 GHz processor. Benchmarks suggest that the performance of this chip is marginally better than the Exynos. RAM is the same at 1GB, storage space is halved to 8GB internal (the SII started at 16GB). But no worries, there's a microSD card slot to increase that. At the back you've got the same 8 megapixel sensor that shoots 1080p HD videos too.",
                "There's a generous 2MP front-facing camera for video calling too. The next major difference is that the SII Plus comes with Android 4.1 Jelly Bean out-of-the-box. Whereas the SII originally ran came with Gingerbread (2.3), but that's not a problem because owners of that phone by now have received the 4.1 JB update. The 1650 mAh battery should give a reasonable up-time, since the phone doesn't have today's modern amenities like an HD display or quad-core chips that sip away more juice."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/xolo-q3000": {
        "text": {
            "Overview": [
                "To survive in the phablet war, Xolo has recently launched Q3000 as a successor to models like Q1000 and Q800. The Xolo Q3000 is a dual-SIM (GSM+GSM) 3G device (with speeds of up to 42.2 Mbps) which will run on Android v4.2 Jelly Bean. It has a 5.7-inch (1080x1920 pixel) full-HD IPS display (compared to Q2000, which has a 5.5 inch 1280 x 720 pixel IPS display). The smartphone will be powered by a quad-core 1.5GHz MediaTek MT6589T processor, which is coupled with 2GB of RAM (the processor and the RAM have been significantly upgraded as compared to its predecessors). The Xolo Q3000 features 16GB inbuilt storage, which is further expandable up to 32GB more via microSD. The Xolo Q3000 smartphone sports a 13-megapixel rear camera which supports Full HD video recording and the secondary 5-megapixel front-facing camera with BSI sensor makes it a great phablet for photogenics. Although the rear camera is not much upgraded, many new features have been added like Low Light Enhancement, Panorama Capture and Geo-tagging. The giant has the following sensors  Accelerometer, Magnetometer, Ambient Light Sensor, Gyroscope and Proximity Sensor.",
                "On the connectivity front, the Xolo Q3000 will include 3G, Wi-Fi, Wi-Fi hotspot, Micro-USB, USB OTG, MHL and Bluetooth 4.0. The smartphone will pack in a 4000mAh battery, which will give you 33 hours and 21 hours of talktime on 2G and 3G respectively. This mammoth is larger than the batteries seen on the Samsung Galaxy Note 3 (3200 mAh) and the Nokia Lumia 1320 (3400 mAh) respectively."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-galaxy-j7-plus": {
        "text": {
            "Introduction:": [
                "The Galaxy J7+ is the company latest offering as a mid-range budget smartphone with top-notch specs. Successor to the Galaxy J7 and the Galaxy J7 Pro, the J7+ gets an all-metal unibody design with a well-built body. "
            ],
            "Display & Hardware:": [
                "Talking about specs, the Galaxy J7+ puts on a 5.5-inch Full HD Super AMOLED display with a resolution of 1920 x 1080 pixels. Under the hood, the phone is powered by an octa-core MediaTek Helio P20 processor ticking at 2.4GHz. Accompanying the chipset, the handset gets 4GB of RAM and 32GB of internal storage further expandable up to 256GB via MicroSD card."
            ],
            "Operating System & Camera:": [
                "The Galaxy J7+ runs Android Nougat out-of-the-box and is expected to get the Android Oreo sometime next year. The phone also gets the Samsung's own AI assistant known as Bixby. Talking about photography, the device sports a dual rear camera setup comprising a 13-megapixel standard lens and a 5-megapixel monochrome lens. The main sensor has an aperture size of f/1.9, thus capable of capturing more light and providing crisp image-output, especially in low-light conditions. Up front, the handset flaunts a 16-megapixel shooter for selfies and video calling."
            ],
            "Battery & Connectivity:": [
                "It's a Dual SIM phone and also supports 4G LTE connectivity. Talking about connectivity options, the phone includes Wi-FI, Bluetooth, VoLTE, and 3.5mm audio jack. The phone also sports a front-mounted fingerprint scanner integrated into the home button. Powering all, the phone packs in a 3,600mAh battery. "
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/xiaomi-mi-note": {
        "text": {
            "Overview": [
                "Mi Note is a phablet from the Chinese manufacturer Xiaomi. This phone directly competes against Samsungs Galaxy Note 3 with nearly same specifications. The Mi Note will be capable to do more than just average tasks. What sets it apart from the Galaxy Note series is the Dual SIM capabilities. It offers flagship level specifications.",
                "Key Features:",
                "A huge 5.7 inches display with 1080p resolution is protected by Gorilla Glass 3 and has a pixel density of 387 PPI. This display is great for almost any practical usage. Even the back of this device is protected by Gorilla Glass.",
                "A 13MP shooter with optical image stabilization ensures you to click great, blur-free, high quality pictures. Dual LED flash will give you a well color balanced shot when you use the flash light. You can record even in 4K. Front camera is a 4MP unit that has few tricks that we saw on the HTCs flagship phones. 2 Ultrapixel pixel will ensure top notch quality selfies.",
                "2.5GHz Snapdragon 801 processor means performance on the Mi Note wont disappoint and with 3GB of RAM, youd need to have enough applications running in the background to make this phone lag. With Adreno 330 GPU powering the graphics, expect this phone to run graphic intensive games.",
                "The only thing that disappoints is that it comes with 16GB of on board storage and there is no SD card expansion slot. You will be stuck with 11GB of user available storage.",
                "It comes with Fast Battery Charging technology that charges battery to 60% in 30 minutes.",
                "Taking advantage of the huge sized body, the battery on the Mi Note is rated at 3000mAh.",
                "It will be available in either black or white.",
                "Alternatives:",
                "Lenovo Vibe Z2 Pro",
                "LG G3",
                "OnePlus One"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-desire-816g-dual-sim-2015": {
        "text": {
            "Overview": [
                "HTC Desire 816G Octa Core is a variant of the HTC 816 which was already a very successful device in India. The 816G Octa Core looks similar to the phone it replaces and is also referred to as the HTC Desire 816G 2015. The features that the phone has to offer are quite good for the price.",
                "The HTC Desire 816G Octa Core still rocks the same 5.5 inch display like the HTC 820 and the older HTC Desire 816. The screen has a resolution of 1280x720 pixels which translates into a pixel density of 267PPI.",
                "The processor has been upgraded on the phone to a 1.7GHz Octa Core unit and it has 1GB of RAM to support it. Some alternatives like the Samsung Galaxy E7 come with 2GB of RAM for roughly the same price.",
                "The device has 16GB of internal storage which is good and around 11GB should be available to the user for storage and installing apps.",
                "The phone also has a MicroSD card slot that accepts cards upto 32GB.",
                "The device rocks a 13 Megapixel BSI sensor and is capable of recording video at 1080p, on the front the device has a 5 Megapixel BSI sensor and is also capable of 1080p recording.",
                "HTC BoomSound Speakers are positioned on the top and bottom of the device, the front facing stereo speakers provide good output.",
                "The device comes with HTCs Sense UI on top of Android 4.4 Kitkat and may be updated to Android Lollipop",
                "This is a Dual SIM device and accepts two nano SIM slots.",
                "The phone has a 2600mAh battery which is non removable and provides around one day of backup with light to moderate use.",
                "Alternatives",
                "Samsung Galaxy E7",
                "Lenovo Vibe X2"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/oppo-r1-r829t": {
        "text": {
            "Overview": [
                "The Oppo R1 is a camera-focused smartphone from the chinese manufacturer. The device sports an 8 megapixel Sony BSI sensor with 5P lens and F2.0 aperture. There's a Blue Glass filter that ensures the sensor captures the best possible pictures in low light condition. The front camera is a 5 megapixel wide angle camera which makes it easier to click group selfies. The front camera also has a blue glass filter just like the rear camera. The software on the phone has also been tweaked to use an independent graphics processing chip to control the Auto Focus, Auto Exposure and Auto White balance before clicking a picture.",
                "The R1 has a thin magnesium alloy frame, measuring 7.1mm. It has a 5 inch IPS display with a resolution of 1280x720 pixels, bringing the pixel density to 294 PPI. The display is protected by Corning Gorilla Glass 3 and should offer decent protection. It has a 1.3GHz Quad Core processor with 1GB of RAM. The device has 16GB of memory which sadly is non-expandable. The R1 runs Oppos Color OS on top of Android 4.2 JellyBean which is an outdated version of the OS. The device has Gesture search where one can draw a gesture on the screen to launch an app. The smart motion feature uses the multiple sensors to answer a call, mute it or to dial a number. The phone has a dedicated PA amplifier for the speaker on the device. The Oppo R1 is a dual SIM device with a non-removable 2410 mAh battery unit. Although the feature list of this phone is impressive, the Moto X is more value for money."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lenovo-s820": {
        "text": {
            "Overview": [
                "The Lenovo S820 is a mid-ranger phone with a 4.66-inch 1280 x 720 pixel IPS display. It is powered by a MediaTek MT6589 quad-core 1.2 GHz chip, the same found on the Micromax Canvas 4. There's 1GB of RAM too; a bare minimum considered these days for phones running Android 4.2 Jelly Bean. There's 4GB of internal storage, which is a little less for a phone in this price range. The camera highlights include a 13 megapixel sensor and a 2MP front-facing cam. The phone's back comes in a bright red colour which should give it a distinctive look. There's a 2000 mAh battery powering the Lenovo S820. Interestingly, this phone is a Single SIM device; which is a rarity for phones in this price range  that are seen to sport dual SIM support."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/sony-xperia-z-ultra": {
        "text": {
            "Overview": [
                "The Sony XPERIA Z Ultra which is available is Black & White colour is based on the XPERIA Z flagship handset from Sony in 2013. The most prominent change is the increase in the display size to a whopping 6.4 inches, making it a smartphone with one of the biggest displays available today (although the Samsung Galaxy Mega 6.3 is pretty close). Although it still retains the same 1920 x 1080 pixel resolution as the XPERIA Z, its still above 300 PPI which should not hamper clarity to the human eye. The next upgrade is the bump up to IP58 certification; making the phone more resilient to water and dust. It is also faster internally, being powered by the current top-of-the-line Snapdragon 800 chipset, clocked at a furiously fast 2.2 GHz. Rest of the specs are similar  2GB of RAM and 16GB on-board storage coupled with a microSD card slot for further expansion. The battery size is also upped to 3050 mAh (from the 2330 mAh battery in the Z), which is good news considering the heavy-duty hardware powering this phone. Now for some bad news  the camera resolution is downgraded from 13 megapixels on the XPERIA Z to 8 megapixels. What's more disappointing is that there isn't an LED flash on the Z Ultra, which could make night-time photography difficult. "
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/blackberry-tour-9630": {
        "text": {},
        "Pros": [
            "Full sized QWERTY keyboard is fantastic to type on",
            "Solid build quality that inspires confidence",
            "Compact size of the device means you can easily use the phone with one hand"
        ],
        "Cons": [
            "Lacks Wi-Fi support",
            "Major shutter lag",
            "The trackball can be very hit and miss"
        ]
    },
    "https://pricebaba.com/mobile/htc-desire-830": {
        "text": {
            "Introduction:": [
                "HTC Desire 830 is a single SIM device that was launched in August 2016. HTC UltraSelfie, water and dust proof grooved power buttons and ultra fine acoustic mesh speaker grilles, completely glass front, HTC UltraPixel technology, rear camera with Optical Image Stabilisation, dual tone design, HTC Sense Home with HTC Themes and HTC BlinkFeed, built-in photo editor, special effects like Prismatic or Double Exposure and HTC BoomSound with Dolby Audio are its major highlights."
            ],
            "Display and Design:": [
                "HTC Desire 830 comes with 5.5 inch LCD touch screen capacitive display, 1920 x 1080 pixels screen resolution and 401PPI pixel density. It has a dimension of 157.5 x 78.9 x 7.8 mm and its weight is 156 grams."
            ],
            "Hardware and Features:": [
                "This single SIM device is loaded with 1.3GHz octa-core MediaTek MT6753 processor, Mali-T720 MP3 graphics, Android 6.0 Marshmallow Operating System, and 3GB RAM. Motion launch, Dot View compatibility, Sensor hub for tracking activity, HTC Connect – 3 – fingers swipe for trouble-free wireless multimedia streaming are available. Ambient light sensor, motion sensor, magnetic sensor are available."
            ],
            "Camera and Storage:": [
                "HTC Desire 830 is loaded with 13MP rear camera and 4MP front camera having ƒ/2.0 aperture and 26.8 mm lens. Other camera features include geotagging, HDR, panorama, face detection, autofocus, LED flash and touch to focus. Users can record full HD videos at 1080p. It has an internal storage of 32GB that can be expanded up to 128GB by using a micro-SD card."
            ],
            "Battery and Connectivity:": [
                "This single SIM device is equipped with a removable 2800mAh Li-ion battery. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, 2G, WiFi, Bluetooth. It takes in 1 nano SIM card."
            ],
            "Competition:": [
                "HTC Desire 830 faces competition from Samsung Galaxy J7 Prime. Samsung Galaxy J7 Prime has faster processor, and higher battery capacity than HTC Desire 830."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-desire-v": {
        "text": {
            "Overview": [
                "The HTC Desire V is the first dual SIM Android powered handset to come from the HTC stables. A GSM-GSM dual SIM capable device, the phone boasts of a 4 inch, 480*800 pixel display and runs Android 4.0 underneath HTC os proprietary Sense UI. It gets a 1 GHz Cortex A5 processor running at 1 GHz which is ably supported with 512 MB of RAM. The Desire V boasts of a 5 megapixel camera that adorns the rear of the device. It is also capable of capturing videos in HD. Connectivity options include Wi-Fi, Bluetooth 3.0 and of course, USB. The Desire V has a GSM plus CDMA capable cousin as well - the recently launched HTC Desire VC."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-desire-sv": {
        "text": {
            "Overview": [
                "HTC Desire SV is one of the few Dual SIM Android smartphones that combines CDMA and GSM. Brining a respectable smartphone to CDMA users who are otherwise left with limited options, the Desire SV with Sense UI is a refreshing change. A 4.3\" full touchscreen running a resolution of 480x800 isn't the best for pixel density but HTC makes up with the total value for money on the device. Dual Micro-SIM supporting both GSM+CDMA, an 8 megapixel camera with a Dual Core GHz processor backed with 768MB of RAM. While you would miss 720p or 1080p HD video recording on the Desire SV, you get a good design, Google Play apps bank and Beats Audio.",
                "Samsung recently launched the Galaxy Grand to compete in this space, a sign that only shows that Dual SIM Androids have finally arrived In India. The Desire SV weighs 131 gms and the 4GB internal storage is backed with 25GB of free Dropbox offer (valid for 24 months)."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/karbonn-s9-titanium": {
        "text": {
            "Overview": [
                "Karbonn S9 Titanium is a recent launch from Karbonn brand S Titanium series and thus replacing Karbonn S5 Titanium. The smartphone supports 2G and 3G network with specifications like GSM 900 / 1800 / 1900 - SIM 1 & SIM 2 and HSDPA 2100 respectively. It supports dual SIM. The smartphone offers a touch screen of size 720 x 1280 pixels, 5.5 inches with an IPS LCD capacitive touch screen with 16M range of colors. The phone runs on an Android OS, v4.2 (Jelly Bean) with a Quad-core processor at a speed of 1.2 GHz. Its got 1GB RAM and an internal memory of 16GB which is upgraded from 4GB as compared to its predecessor  the Karbonn S5 Titanium. The expandable memory is up to 32GB (micro SD).",
                "The phone sports a 13 MP camera with 4128 x 3096 pixels, autofocus and an LED flash and a front-facing camera of 5MP. Wherein the secondary camera is upgraded from 8MP to 13MP and front facing camera is also upgraded from 2MP to 5MP as compared to its predecessor  the Karbonn S5 Titanium. The additional features that the phone encompasses are Geo-tagging and touch focus. The phone has a 2600 mAh standard Li-ion battery which provides a sufficiently good battery life in talk time and in stand-by mode as well."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/xolo-a500l": {
        "text": {
            "Overview": [
                "The demand for budget Android phones is ever-increasing. To face the stiff competition in the market, Xolo has recently launched A500L as a successor to A500. On the feature front, the Xolo A500L comes with a 4-inch WVGA display with 480×800 pixels resolution (same as Xolo A500) having a pixel density of 233PPI (which is decent enough for a phone of this price range). The phone runs on the Android 4.2 Jelly Bean and is powered by a dual-core MediaTek 6572 processor with 1.3GHz clock speed, a Mali-400 MP GPU and 512MB of RAM. (the processor has been slightly upgraded by 300MHz but the RAM has been unchanged as compared to Xolo A500). It also has 4GB of internal storage which can be expanded by up to 32GB with microSD card.",
                "Other features include a 3-megapixel rear camera with LED flash, compared to 5-megapixel rear camera of Xolo A500, which is a letdown. Theres a basic VGA front facing camera. The A500L supports dual-SIM, Wi-Fi, Wi-Fi Hotspot, Bluetooth, AGPS, 3G network with speeds of up to 21.1 Mbps, and sensors like accelerometer, ambient light sensor and proximity sensor. Also, the phone houses a 1500mAh battery which as per the companys claims offers up to 13 hours of talktime, and lasts for up to 681 hours on standby time."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lg-g-flex-d958": {
        "text": {
            "Overview": [
                "The Korean manufacturing company has launched a revolutionary smartphone. The phone has a unique form factor. As the name implies, the G Flex indeed offers a little flexibility. The LG G Flex features a 6-inch curved OLED (Organic Light Emitting Diode) screen with 720p resolution with a pixel density of 245PPI (which is less for a phone of this price range, considering most Android flagships now have 1080p displays). The curved form-factor provides a never-seen-before viewing experience. The slightly curved screen can be momentarily flattened to 180 degrees. The phone has unique durability thanks to its self healing scratch resistant back. Meaning, minor scratches will disappear after some time, thanks to the special material used to make the backplate. The phablet is powered by a quad-core 2.26GHz Snapdragon 800 (MSM8974) processor with an Adreno 330 GPU, and 2GB of RAM.",
                "On photography front, it is similar to the companys flagship device G II. The phone has a 13 megapixel rear camera and a 2.1 megapixel secondary camera for video calling and selfies. Both the cameras support HD recording at 1080p. It can simultaneosly record videos and take images. But this mammoth lacks Optical Image Stabilisation(OIS). The device runs on Android v4.2 Jelly Bean. Apart from the 'Rear Keys' introduced with the G2, the LG G Flex also incorporates the some cool user interface features, such as QTheater for quick access to photos, videos and YouTube from the lock screen and also Dual Window for multitasking with two windows.",
                "The device has a curved battery of 3,500mAh (bigger than many other phablets like Note III and Lumia 1520). All in all, the self-healing back is an interesting feature, while the curved display fails to convince of any real usability advantage, other than being a cool party trick."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-galaxy-m42-5g-8gb-ram": {
        "text": {
            "Overview": [
                "Samsung's upcoming mid-ranger dubbed Samsung Galaxy M42 5G 8GB RAM is one of the cheapest 5G devices of all time. This 5G device also has the potential to be crowned as the next mid-range killer. Not just that but the smartphone packs in a great value for money and some amazing specs for the price such as a beautiful AMOLED display, a huge 5000mAh battery, a great camera setup, and a lot more. The smartphone is powered by the Snapdragon 750G SoC."
            ],
            "Design and Display": [
                "The Samsung Galaxy M42 5G 8GB RAMboasts a 6.6 inch Super AMOLEDdisplay with a resolution of 720 x 1600 pixelsand a high pixel density of 266ppi to fabricate rich and crisp visuals. The bezel-less display sports an immersive notch design along with an aspect ratio of 20:9 for enhanced viewing experience."
            ],
            "Cameras": [
                "The Samsung Galaxy M42 5G 8GB RAM houses a quad rear camera with a powerful 48MP wide-angle primary sensor, an 8MP wide-angle sensor, a 5MP macro sensor, and a 5MP depth sensor with LED flash support onboard. Coming to the front, the device features a powerful 20MP wide-angle selfie shooter. The camera arrives with features likeAuto Flash, Auto Focus, Bokeh Effect, Continuos Shooting, Exposure compensation, Face detection, Geo tagging, High Dynamic Range mode (HDR), ISO control, ISOCELL Plus, Touch to focus, White balance presets."
            ],
            "Battery and Performance": [
                "The Samsung Galaxy M42 5G 8GB RAM is baked with the Qualcomm Snapdragon 750G chipset coupled with an Adreno 619GPU. The device comes assembled with 8GB RAM paired with an internal storage capacity of 128 GB, which can be expanded upto a whopping 1TB. Fuelling the device is a huge 5000mAh Li-ion battery with fast charging support on board."
            ],
            "Software and Connectivity": [
                "Samsung Galaxy M42 5G 8GB RAM runs Samsung One UI on top of Android 11 out of the box. For the connectivity options, the smartphone supports features like 5G, dual sim VoLTE(Nano + Nano(Hybrid)), Wi-Fi 802.11, a/ac/b/g/n/n 5GHz, GPS, NFC, and Bluetooth 5.0. Furthermore, the smartphone packs in a USB Type-C port, a 3.5mm headphone jack ,and an on-screen fingerprint sensor as well."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/tecno-phantom-6": {
        "text": {},
        "Pros": [
            "Comes with dual rear cameras",
            "It has a reversible Type-C port for charging",
            "3GB of RAM is sufficient for multi-tasking",
            "Supports fast charging"
        ],
        "Cons": [
            "Software comes with a lot of bloatware",
            "Lacks fingerprint sensor",
            "The iris scanner is more of a gimmick"
        ]
    },
    "https://pricebaba.com/mobile/nokia-lumia-820": {
        "text": {
            "Overview": [
                "A part of the 2nd gen Lumia series phones running Windows Phone 8, the Lumia 820 is the numerical successor to the Windows Phone 7 powered Lumia 800. The phone falls right underneath the current flagship, the Lumia 920. The phone features a 4.3\" AMOLED ClearBlack display sporting a resolution of 800x400; a step down from the 1280 x 768 pixel HD resolution of the Lumia 920. There's a 8 megapixel camera too, but it doesn't have the OIS (Optical Image Stabilisation), which is the trump-card feature of its older brother. Both share the same 1.5GHz Dual-Core processor (S4 Snapdragon) and 1GB RAM. Internal storage on the Lumia 820 is just 8GB, but thankfully is complimented by a microSD card slot. Although there's a front-facing camera for video calls, it bears a VGA (0.3MP) resolution, and unlike the 1.3MP sensor on the Lumia 920. The phone supports penta-band LTE, along with typical 3G and WiFi hookups. There is a 1650 mAh battery powering the Lumia 820 and although Wireless charging doesn't come out of the box, there's a separately sold backplate that enables that. The Lumia 820 comes in yellow, purple, cyan, red, grey, black and white colours."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/nubia-n1": {
        "text": {
            "Overview": [
                "A subsidy brand of ZTE, Nubia is in the Indian market since quite sometime now. Even though the sales of the brand are not that promising, the brand still has managed to survive in this cut throat competition. Nubia has been selling its devices in an exclusive partnership with Amazon India, whereas ZTE branded phones are exclusive to Flipkart."
            ],
            "Design & Display": [
                "The phone has a metal unibody construction but is quite thick at 8.9mm. The design looks & feels solid but the extra thickness might be a bummer. On the front lies a 5.5-inch FHD display with a pixel density of 401PPI & is protected by Corning Gorilla Glass 3."
            ],
            "Hardware & Features": [
                "MediaTek's Helio P10 MT6755 Octa Core processor is the one used in this device & is paired with 3GB of RAM which delivers decent overall performance. On the software front, it runs on Android 6.0 Marshmallow out of the box. Besides, it has a fingerprint sensor for additional protection on the rear of the device."
            ],
            "Camera & Storage": [
                "Both rear & front of the device sport a 13MP camera that can shoot videos up to 1080p & should capture good shots as well. And to store all the date you get 64GB internal storage that can further be expanded up to 256GB via a MicroSD card."
            ],
            "Battery & Connectivity": [
                "The massive 5000mAh battery of the Nubia N1 is a huge plus & should easily last you for more than a day. Sadly, it does not support fast or wireless charging. It is a Dual SIM device if you do not wish to use a MicroSD card (hybrid second slot) & support all major networks in India. Yes, Reliance Jio is also supported, thanks to the VoLTE feature."
            ],
            "Alternatives": [
                "Moto G5 Plus"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-desire-500": {
        "text": {
            "Overview": [
                "The HTC Desire 500 is a slightly watered down version of the Desire 600. It has a slightly smaller 4.3-inch display with a typical 800 x 480 pixel WVGA resolution. It is powered by a Snapdragon 200 quad-core chip clocked at 1.2GHz. There's 1GB of RAM and half the internal storage of the Desire 600 (i.e. 4GB). A microSD card slot is available for expansion though. It shares the same 8 megapixel BSI sensor camera at the rear and a front-facing 1.6MP camera. It can record videos in 720p HD resolution. It runs a fairly recent Android 4.2.2 Jelly Bean with the Sense 5 User Interface as seen in the HTC One. Connectivity-wise, the Desire 500 has 3G support of up to 7.2 Mbps, WiFi 802.11n and Bluetooth 4.0. There's a dual-SIM variant of this phone too. The 1800 mAh battery sounds reasonably large to cater to the lower mid-range specs of this phone."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-galaxy-c5-pro": {
        "text": {
            "Overview": [
                "Introduction:",
                "Design and Display:",
                "Hardware and Features:",
                "Camera and Storage:",
                "Battery and Connectivity:"
            ],
            "Alternatives": [
                "2. Lenovo K6 Power",
                "3. HTC Desire 10 Pro"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-galaxy-c5-64gb": {
        "text": {
            "Overview": [
                "The Samsung Galaxy C5 is one of the very first devices in the 'C Series' of smartphones from Samsung. The series is primarily focused at coming up with smartphones with metallic body and no compromise specifications. Alongside the Galaxy C5, the Galaxy C7 is the other device in the C Series that we have already seen."
            ],
            "Display and Design": [
                "First look at the Samsung Galaxy C5 and you would be excused for mistaking it for the iPhone 6. In fact, the device also features the dreaded and much criticised rubber antennae lines that run on the back. As for the display, just like every high-end Android phone from Samsung, the display is drop dead gorgeous. You get a 5.2 inch screen with a Full HD resolution, giving the screen a pixel density of 424. Add to the fact that the display is Super AMOLED, the colours really pop out of the display."
            ],
            "Hardware and Features": [
                "Powering the Samsung Galaxy C5 is an Octa Core Snapdragon 617 chipset with Adreno 405 GPU. There is 4GB of RAM to keep your experience stutter free. You also have a fingerprint scanner on the home button. As for the internal storage, you have an option of picking either a 32GB or a 64GB variant. It should not prove to be too difficult a decision as the phone features a Hybrid SIM slot, which can double up as a slot for the MicroSD card. As with every Android phone made by Samsung, there is a custom TouchWiz UI on top. Below it is the latest Android 6.0.1 Marshmallow."
            ],
            "Camera and Storage": [
                "The rear camera on the Samsung Galaxy C5 features a 16 MP sensor. There is a dual tone LED flash on the rear to assist you with shooting when there is not sufficient light. The rear camera is capable of recording 1080p videos at 30fps. The front facing camera is an 8MP shooter. As mentioned above, the internal storage is either 32GB or 64GB depending on your choice, though you do get a slot to expand that storage using a MicroSD card of up to 128GB."
            ],
            "Battery and Connectivity": [
                "The Galaxy C5 features a non-removable 2600mAh Li-Ion battery. The battery should last you for a working day on moderate usage. Just like most modern day phones, the Samsung Galaxy C5 comes with a vast array of connectivity options. You have the likes of WiFi, Bluetooth, LTE, GPS, NFC all on board. This device has a hybrid SIM slot, so you can easily have two micro SIM cards in there with dual standby. You also get fest battery charging which promises to charge up to 83% of your phone in just 30 minutes."
            ],
            "Competition": [
                "The device competes in a very crowded segment of smartphones. You have the classic devices like the Motorola Moto X Style, which is a very stylish device with a near stock experience well as the likes of Xiaomi Mi5 which comes with the latest Snapdragon 820 chipset. You could also look at devices like the LG Nexus 5X, OnePlus 2 or OnePlus 3 which will be a very capable device to pick if you do not wish to invest in the Samsung device."
            ]
        },
        "Pros": [
            "Well built body with just 6.7mm thickness",
            "Sharp and bright AMOLED display",
            "Good battery life"
        ],
        "Cons": [
            "Average performance, not for gamers",
            "Heats up with extensive usage",
            "Rear camera does not shoot great pictures unless HDR mode used, HDR clicks at just 8MP"
        ]
    },
    "https://pricebaba.com/mobile/lenovo-k80": {
        "text": {
            "Overview": [
                "The Chinese multinational company, Lenovo has come up with another device the K80. This time the brand has released it’s sort of flagship device with some good specs. The Lenovo K80 sports a Quad Core Intel processor clocked at 1.8GHz and is available in two variants viz. 2GB RAM with 32GB internal storage and the other comes with 4GB RAM with 64GB internal storage.",
                "In terms of camera the phone has a 13MP rear camera that can record videos up to 1080p. The camera also features OIS and has a Single LED Flash. The display is a 5.5 inch Full HD (1920x1080 pixels) LCD panel giving it a pixel density of 401PPI.",
                "Lenovo K80 is powered by a massive 4000mAh non-removable battery and supports single Micro SIM and unfortunately the device lacks 4G support. The phone also supports storage expansion up to 32GB via a MicroSD card and runs on Android Lollipop (5.0) out of the box with Lenovo’s Vibe UI running on top."
            ],
            "Alternatives": [
                "OnePlus X",
                "Moto X Play 16GB",
                "Lenovo Vibe X3 32GB"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-desire-501-dual-sim": {
        "text": {
            "Overview": [
                "HTC Desire 501 Dual SIM is a mid-range launch by HTC. The phone has attractive rear shells sporting different designs. The smartphone supports Dual SIM (GSM + GSM). The phones got 4.3 inches of display size with Super LCD2 Capacitive touch screen and weighs 130 grams. The phone runs on Android 4.1 Jelly Bean using a Dual-Core processor with 1.15 GHz processor speed. HTC Desire 501 has 1GB RAM memory and an internal storage of 8GB which can be expanded up to 64 GB. The primary camera sports 8 MP resolution with autofocus and Flash light. Other camera features like Geo-Tagging, Face & Smile Detection is also offered by the smartphone. Desire 501 can also record Videos at 720p. The secondary camera sports 2.1MP sensor which can be used for video calling purposes. A removable Lithium-Ion 2100 mAh battery is used which is expected to give satisfactory results, considering the modest specifications."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/alcatel-x1": {
        "text": {
            "Introduction:": [
                "Alcatel X1 is a dual SIM device that was launched in June 2016. Slim built, 3D spin effect, anodized aluminium border, UltraPixel technology, hands-free eye-biometric system for phone unlocking and Hi-Fi HD Sound with Cirrus Logic technology, Arkamys Acoustic Enhancement Technology are its major highlights."
            ],
            "Display and Design:": [
                "Alcatel X1 comes with 5 inch LCD touch screen capacitive AMOLED display, Corning Gorilla glass on the back side, Dragontrail glass on the front side, 1280 x 720 pixels screen resolution and 294PPI pixel density. It has a dimension of 145.00 x 69.20 x 6.90 mm and its weight is 140 grams. It is available in White and Black colours."
            ],
            "Hardware and Features:": [
                "This dual SIM device is loaded with 1GHz octa-core Qualcomm Snapdragon 415 processor, Adreno 405 graphics, Android 5.1 Lollipop Operating System, and 2GB RAM. It has light sensor, E-compass, G-sensor, motion sensor and proximity sensor. Google Talk, Twitter, Facebook chat, YouTube, Gmail, Google Search, Google+, WhatsApp are available."
            ],
            "Camera and Storage:": [
                "Alcatel X1 is loaded with 13MP rear camera with 5P lens, f/2.2 aperture and 8MP front camera with 1.4 um pixel size, f/2.0 aperture. Other camera features include autofocus, dual tone LED flash. Users can record full HD videos at 1080p. It has an internal storage of 16GB that can be expanded up to 128 GB by using a micro-SD card."
            ],
            "Battery and Connectivity:": [
                "This dual SIM device is equipped with a 2150mAh Li-ion battery that lets the users enjoy a talk time of up to 19 hours on 2G networks. Users can enjoy connectivity through 4G LTE (India Compatible), 3G, 2G, WiFi, Bluetooth. It takes in 1 micro SIM card and 1 nano SIM card."
            ],
            "Competition:": [
                "Alcatel X1 faces competition from Nokia Lumia 730 Dual SIM. Nokia Lumia 730 Dual SIM has smaller screen and poor camera than Alcatel X1."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/asus-zenfone-6": {
        "text": {
            "Overview": [
                "Another release by the company is the Asus Zenfone 5."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/vivo-y73-2021": {
        "text": {
            "Overview": [
                "Vivo's upcoming mid-ranger dubbed Vivo Y73 2021 might actually be one of the cheapest devices of all time. This device also has the potential to be crowned as the next mid-range killer. Not just that but the smartphone will also pack in a great value for money and some amazing specs for the price such as a huge 4000mAh battery, a great camera setup, and a lot more. The smartphone will be powered by the MediaTek Helio G95 SoC."
            ],
            "Design and Display": [
                "The Vivo Y73 2021 will reportedly boast a 6.44 inch AMOLEDdisplay with a resolution of 1080 x 2400 pixelsand a high pixel density of 409ppi to fabricate rich and crisp visuals. The bezel-less display will supposedly sport an immersive Waterdrop notch design along with an aspect ratio of 20:9 and a screen to body ratio of 90.6% for enhanced viewing experience."
            ],
            "Cameras": [
                "The Vivo Y73 2021 is expected to house a triple rear camera with a powerful 64MP primary sensor, an 2MP macro sensor, and a 2MP depth sensor with LED flash support onboard. Coming to the front, the device will feature a powerful 16MP selfie shooter. The camera will arrive with features likeArtificial Intelligence, Auto Flash, Auto Focus, Bokeh Effect, Continuos Shooting, Exposure compensation, Face detection, Geo tagging, High Dynamic Range mode (HDR), ISO control, Time Lapse, Touch to focus, White balance presets."
            ],
            "Battery and Performance": [
                "The Vivo Y73 2021 will be baked with the MediaTek Helio G95 chipset coupled with a Mali-G76 MC4GPU. The device will come assembled with 8GB RAM paired with an internal storage capacity of 128 GB, which can be expanded upto 1TB. Fuelling the device will be a huge 4000mAh Li-ion battery with flash charging support on board."
            ],
            "Software and Connectivity": [
                "Vivo Y73 2021 will run Android 11 out of the box. For the connectivity options, the smartphone will support features likedual sim VoLTE(Nano + Nano), Wi-Fi 802.11, b/g/n, GPS, Radio ,and Bluetooth 5.0. Furthermore, the smartphone will also pack in a USB Type-C port, a 3.5mm headphone jack ,and an on-screen fingerprint sensor as well."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/realme-x2-128gb": {
        "text": {
            "Overview": [
                "Realme X2 comes with a large battery capacity that will deliver long power backup for the users. In terms of camera, it can be a perfect choice for the users. Under the hood, the hardware also renders smooth and lag-free performance with the strong processor. Above all, lies the trendy look that is worth the flaunt."
            ],
            "Display and Battery": [
                "Realme X2 flaunts an amazing curved glass display that offers an edge-to-edge view. It stands 6.4-inch screen that has a resolution of 1,080 x 2,340 pixels. It carries an aspect ratio of 19.5:9. The Super AMOLED display is enhanced with the 403 PPI pixel density, which is excellent to provide a sharp and immersive view.",
                "To draw its power, the device has a 4,000mAh Li-ion battery, which is enough to deliver a full day of power backup. It also has wireless charging technology and fast charging support."
            ],
            "Configuration and Connectivity": [
                "At its core, Realme X2 equips with a 2.2GHz dual-core processor along with a 1.8GHz hexa-core unit. The combination is seated on the Qualcomm Snapdragon 730G. A 6GB RAM ensures smooth gaming and multitasking of the device. There is an Adreno 618 GPU, which is great to offer graphics.",
                "It supports VoLTE, WiFi, NFC, Bluetooth, 2G, 3G, 4G LTE."
            ],
            "Storage and Camera": [
                "For storage, there is 128GB internal memory. It also has up to 256GB external memory with the help of a microSD card.",
                "In terms of optics, the device has quad rear cameras having 64MP, 8MP, 2MP and 2MP lenses. It features 5 x Digital Zoom, Auto Flash, Face detection, Touch to focus, etc. A 32MP front camera ensures amazing selfie pictures."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/asus-zenfone-2-laser-ze601kl": {
        "text": {
            "Overview": [
                "Asus is back with a new device, focusing mainly in the market of huge displays. This time around is the new device Asus Zenfone 2 Laser ZE601KL which sports a massive 6 inch display. Honestly it’s too huge for a single hand use but great for media consumption. This display has a Full HD resolution of 1920x1080 pixels making it a total of 367PPI, which is sharp & you definitely won’t be seeing pixelation.",
                "On the inside the Asus Zenfone 2 Laser ZE601KL is rocking a brand new Snapdragon 616 Processor clocked at 1.7GHz with 2GB",
                "The device has a 13MP rear camera which is capable for recording 1080p videos with a flash. And on the front lies the 5MP camera. The phone has 32GB internal storage with expandable storage option up to 128GB via an expandable MicroSD card. There is another variant ",
                "The Zenfone 2 Laser ZE601KL is a Dual SIM device which supports 4G. The phone is powered by a 3000mAh battery & runs on Android 5.0 Lollipop with Asus’s ZenUI running on top. The smartphone is available in three colors viz. Gold, Red, Silver."
            ],
            "Alternatives": [
                "Moto X Play 16GB",
                "OnePlus X",
                "Lenovo Vibe P1"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/nokia-e6": {
        "text": {
            "Overview": [
                "Symbian might be on its way out after years of domination - but Nokia even as they are making the big switch over to Windows Phone, is dependent on this old platform for a decent chunk of its sales. That brings us to the Nokia E6 which debuted back in 2011 as a successor to the hugely popular E72 and is still on sale. The E6 had huge shoes to fill and it managed to do it thanks to the enhanced features that it boasted of. The E6 was the first Nokia phone to sport VGA screen resolution and the first E Series candybar phone to sport both - a touchscreen and a full fledged QWERTY keypad. Thanks to the smaller screen size and the high resolution, it boasted of a higher pixel per inch density than that of the iPhone 4 and the retina display. In its current avatar, the E6 gets Symbian Belle which by far is the best Symbian version of all times - although some might disagree!"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/sony-xperia-sp": {
        "text": {
            "Overview": [
                "The XPERIA SP is a pretty interesting mid-range phone. Its got a good 1.7 GHz dual-core Snapdragon S4 Pro chip, 1GB RAM and the Adreno 320 GPU  thereby ensuring that it is ready for heavy lifting. The internal 8GB memory leaves a reasonable 5.8GB free for the user, other than the microSD slot for storing media of course. The 4.6-inch 720p HD display is complemented with an transparent edge below it. When viewing photos, this edge emits colours that are in tune with the image on the screen; somewhat similar to the Ambilight technology Philips used in TVs. The 8MP camera at the back records 1080p Full HD videos at a smooth 30 fps. The 2370 mAh battery claims to deliver decent battery life given the power-hungry internals. Lastly, the phone is built quite well; holding it gives you that awesome feeling of solidity, which unfortunately, is not common these days."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/poco-f1-armoured-edition": {
        "text": {
            "Overview": [
                "Poco has now officially launched the Poco F1 Armoured Edition which turns out to be a budget smartphone that tries to deliver the absolute bang for the buck. The specifications make it quite clear that Poco has made a great attempt to deliver way more for the price. The Poco F1 Armoured Edition has a large 4000mAh battery and a Qualcomm Snapdragon 845 chipset. The device also scores well in the display and cameras department."
            ],
            "Design and Display": [
                "The Poco F1 Armoured Edition features a 6.18 inch IPS LCD display with a resolution of 1080 x 2246 pixels and a pixel density of 403ppi. The display has a notch with less bezels and an aspect ratio of 18.7:9.The device comes with added Corning Gorilla Glass protection."
            ],
            "Cameras": [
                "The Poco F1 Armoured Edition houses a dual camera system consisting of a 12MP primary sensor, and a 5MP sensor with LED flash. For selfies, the device comes with a 20MP camera sensor on the front. Features like Artificial Intelligence, Auto Flash, Auto Focus, Bokeh Effect, Continuos Shooting, Electronic Image Stabilization (EIS), Exmor-RS CMOS Sensor, Exposure compensation, Face detection, Geo tagging, High Dynamic Range mode (HDR), ISO control, Touch to focus, White balance presets are some of the many other that the camera supports."
            ],
            "Battery and Performance": [
                "The Poco F1 Armoured Edition is embedded with the Qualcomm Snapdragon 845 chip and a Adreno 630 GPU. The RAM and internal storage of the device stand at 8GB and 256GB respectively. The device also supports memory cards up to 256GB. Battery life with this device is not going to be an issue with the large 4000mAh Li-Polymer battery that it comes with."
            ],
            "Software and Connectivity": [
                "Poco F1 Armoured Edition runs MIUI on the top of Android 8.1 out of the box. The smartphone has a variety of connectivity options like dual SIM 4G(Nano + Nano(Hybrid)), Wi-Fi 802.11, a/ac/b/g/n, GPS, Radio and Bluetooth 5.0. Coming to ports selection, the device has a USB Type-C port , a 3.5mm headphone jack, and a rear-mounted fingerprint sensor placed on the side of the device."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/poco-f1-256gb": {
        "text": {
            "Overview": [
                "Poco has now officially launched the Poco F1 256GB which turns out to be a budget smartphone that tries to deliver the absolute bang for the buck. The specifications make it quite clear that Coolpad has made a great attemp to deliver way more for the price. The Poco F1 256GB has a large 4000mAh battery and a Qualcomm Snapdragon 845 chipset. The device also scores well in the display and cameras department."
            ],
            "Design and Display": [
                "The Poco F1 256GB features a 6.18 inch IPS LCD display with a resolution of 1080 x 2246 pixels and a pixel density of 403ppi. The display has a notch with less bezels and an aspect ratio of 18.7:9.The device comes with added Corning Gorilla Glass and water resistance as well."
            ],
            "Cameras": [
                "The Poco F1 256GB has a dual camera system consisting of a 12MP primary sensor, and a 2MP sensor with LED flash. For selfies, the device comes with a 20MP camera sensor on the front. Features like Artificial Intelligence, Auto Flash, Auto Focus, Bokeh Effect, Continuos Shooting, Electronic Image Stabilization (EIS), Exmor-RS CMOS Sensor, Exposure compensation, Face detection, Geo tagging, High Dynamic Range mode (HDR), ISO control, Touch to focus, White balance presets are some of the many other that the camera supports."
            ],
            "Battery and Performance": [
                "The Poco F1 256GB is embedded with the Qualcomm Snapdragon 845 chip and a Adreno 630 GPU. The RAM and internal storage of the device stand at 8GB and 256GB respectively. The device also supports memory cards up to 256GB. Battery life with this device is not going to be an issue with the large 4000mAh Li-Polymer battery that it comes with."
            ],
            "Software and Connectivity": [
                "Poco F1 256GB runs with MIUI on the top of Android 8.1 out of the box. The smartphone has a variety of connectivity options like dual SIM 4G(Nano + Nano(Hybrid)), Wi-Fi 802.11,a/ac/b/g/n, GPS, Radio and Bluetooth 5.0. Coming to ports selection, the device has a USB Type-C port , a 3.5mm headphone jack, and a rear-mounted fingerprint sensor placed on the side of the device."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/oppo-a53s-5g-8gb-ram": {
        "text": {
            "Overview": [
                "OPPO's upcoming mid-ranger dubbed OPPO A53s 5G 8GB RAM might actually be one of the cheapest 5G devices of all time. This 5G device also has the potential to be crowned as the next mid-range killer. Not just that but the smartphone will also pack in a great value for money and some amazing specs for the price such as a beautiful AMOLED display, a huge 5000mAh battery, a great camera setup, and a lot more. The smartphone will be powered by the MediaTek Dimensity 700 MT6833 Octa core SoC."
            ],
            "Design and Display": [
                "The OPPO A53s 5G 8GB RAM will reportedly boast a 6.52 inch IPS LCDdisplay with a resolution of 720 x 1600 pixelsand a high pixel density of 269ppi to fabricate rich and crisp visuals. The bezel-less display will supposedly sport an immersive Waterdrop notch design along with an aspect ratio of 20:9 and a screen to body ratio of 88.7% for enhanced viewing experience. The display will arrive with a refresh rate of 60Hz."
            ],
            "Cameras": [
                "The OPPO A53s 5G 8GB RAM is expected to house a triple rear camera with a 13MP wide-angle primary sensor, a 2MP macro sensor, and a 2MP depth sensor with LED flash support onboard. Coming to the front, the device will feature a 8MP wide-angle selfie shooter. The camera will arrive with features likeAF Phase Detection, Artificial Intelligence, Auto Flash, Auto Focus, Bokeh Effect, Continuos Shooting, Exposure compensation, Face detection, Geo tagging, High Dynamic Range mode (HDR), ISO control, Time Lapse, Touch to focus, White balance presets."
            ],
            "Battery and Performance": [
                "The OPPO A53s 5G 8GB RAM will be baked with the MediaTek Dimensity 700 MT6833 Octa core chipset coupled with an Mali-G57 MC2GPU. The device will come assembled with 8GB RAM paired with an internal storage capacity of 128 GB, which can be expanded upto a whopping 1TB. Fuelling the device will be a huge 5000mAh Li-ion battery ."
            ],
            "Software and Connectivity": [
                "OPPO A53s 5G 8GB RAM will run ColorOS UI on top of Android 11 out of the box. For the connectivity options, the smartphone will support features like 5G, dual sim VoLTE(Nano + Nano), Wi-Fi 802.11, a/ac/b/g/n, GPS, and Bluetooth 5.0. Furthermore, the smartphone will also pack in a USB Type-C port, a 3.5mm headphone jack ,and a side-mounted fingerprint sensor as well."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/vivo-v5-plus-ipl-limited-edition": {
        "text": {
            "Overview": [
                "Ahead of IPL 2017, Vivo introduced the limited edition of the V5 Plus. The biggest attraction, it comes with a humongous 20MP camera up front alongside an 8MP secondary camera for capturing selfies. Below that, 1920 x 1080 pixels stretched across a 5.5-inch display result in 401 PPI pixel density. The display further comes protected with Corning Gorilla Glass 5 protection with 2.5D curved glass on top."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-desire-x": {
        "text": {
            "Overview": [
                "The HTC Desire X is a lower mid-range handset by the Taiwanese phone maker. It's got a 4-inch 800 x 480 pixel Super LCD display, a dual-core 1GHz processor and 768MB of RAM. There's 4GB of internal memory, assumingly around half of which should be available to the user. There's a microSD card slot to expand further. The Desire X is a 3G-enabled handset with speeds of up to 7.2 Mbps. It also has Bluetooth 4.0 support as well. The 5 megapixel autofocus sensor at the back can shoot videos in a non-HD 480p resolution (a.k.a DVD resolution, presumably due to the low-end Adreno 203 graphics chip. It runs Android 4.1 Jelly Bean with HTC's Sense UI 4. Powering this device is a 1650 mAh Lithium ion battery. The Desire X has now been discontinued, and replaced with the Desire X Dual SIM, which is essentially the same handset but with two SIM card slots."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-galaxy-grand-max-sm-g720n0": {
        "text": {
            "Overview": [
                "Samsung Grand series have been highly successful since its launch a couple of years back. With the Galaxy Grand Max it aims to cash in on the already popular Grand series and bring a different phone to the masses. The phone is available in two colours: Grey & White. ",
                "The features of the Samsung Galaxy Grand Max are as follows",
                "5.25 Inch display with a resolution of 1280x720 pixels",
                "1.2 GHz Snapdragon 410 Processor with 1.5GB of RAM",
                "16GB Internal storage for apps and user data",
                "MicroSD card supports cards upto 64GB",
                "13 Megapixel Autofocus camera with LED Flash",
                "5 Megapixel front facing wide angle camera",
                "Samsung TouchWiz UI on top of Android 4.4 Kitkat",
                "2500mAh Battery",
                "Dual SIM",
                "Alternatives",
                "HTC Desire 816G",
                "Micromax Canvas 4 Plus",
                "Micromax Canvas Nitro"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/letv-le-2-pro-4gb-64gb": {
        "text": {
            "Intro:": [
                "Le 2 Pro 64GB launched in April, 2016. This device has an maximum internal memory of 64GB. The primary camera of the phone is 21MP. It is built with CDLA (Continual Digital Lossless Audio) technology due to which users will get loss-less experience of finest quality audio."
            ],
            "Display and Design:": [
                "The dimension of this device is "
            ],
            "Hardware & Features:": [
                "The Le 2 Pro 64GB has a chipset of MediaTek MT6797T Helio X25 and a processor of Deca-core (2x2.5GHz Cortex-A72, 4x2GHz Cortex-A53, 4x1.4GHz Cortex-A53). The inbuilt OS of the device is Android 6.0 version (Marshmallow)."
            ],
            "Camera & Storage:": [
                "The Le 2 Pro 64GB has a primary camera of 21MP and the secondary camera of 8MP available with a LED flash light. The internal storage is 64GB with no extra slot of external memory card. The users can watch Full HD 1080p video in fine quality."
            ],
            "Battery & Connectivity:": [
                "The Le 2 Pro 64GB has a non-removable battery of 3000mAh which provides a great amount of battery backup and stand by features and it also supports fast charging. The device has both 4G and 3G features and Wi-Fi functionalities."
            ],
            "Competition": [
                "This mobile can be considered as an affordable product in this category of mobile phones. Samsung Galaxy A8 has some equivalent specifications when compared to Le 2 Pro. ",
                "Frequently Asked Questions (FAQs) About LeEco Le 2 Pro 64GB",
                "1. Will this phone support Reliance Jio network?",
                "Ans: ",
                "2. What type of charging connector do I need?",
                "Ans: This phone comes with the latest USB Type-C port for charging and data syncing.",
                "3. What is the internal storage size available to install apps?",
                "Ans: Out of the 64GB onboard storage, around 52GB is available to the user to install apps and store other data."
            ],
            "4. Is this a good phone for gaming?": [
                "Ans: Yes, Le 2 Pro sports good hardware and should run most games without any issues.",
                "5. Will this phone get future software updates of Android?",
                "Ans: LeEco like Xiaomi has never focused on providing Android updates but rather focus on their own eUI to improve performance and feature additions.",
                "6. Does the phone support 4K video recording?",
                "Ans: Yes, the Le 2 Pro has a 21MP rear camera that can shoot videos up to 4K resolution."
            ],
            "7. Does it support USB OTG?": [
                "Ans: Yes, apart from the internal storage, this phone also support USB OTG wherein you can transfer and browse the content of your pen drive or a HDD on your phone."
            ],
            "8. Is the battery removable?": [
                "Ans: Having a metal unibody construction, the Le 2 Pro's battery is not user removable."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lava-xolo-x900": {
        "text": {
            "Overview": [
                "Xolo X900 is a stylish smartphone running on Android Ice Cream Sandwich by Lava Mobiles. Intel partnered with Lava Mobiles to make an entry in the smartphone market after being rejected by the giants like Samsung, HTC, LG and others. X900 has a 1.6 GHz Intel Atom processor and 1 GB RAM allowing fast web browsing, responsive apps and better multi-tasking. The processor comes with Hyper-Threading technology ensuring the applications get loaded in minimum time. The phone also contains a 400 MHz Graphics Engine providing rich 3D gaming experience with super-responsive graphics. The display on the device is a 4 inch TFT LCD Capacitive touchscreen and screen resolution of 1024 x 600 pixels giving full HD video output.",
                "The phone features an 8 MP camera with burst mode, allowing the users to take up to 10 pictures in less than a second. However, the image quality is not as good as what we would expect with an 8 MP camera. The camera unit has been clubbed with an application allowing filters like Sepia, Black and White, Negative and more. The back camera allows you to capture 1080 p HD videos and the 1.3 MP front camera is capable of recording 720 p videos. One major problem the users might face is the lack of compatibility of the applications present in the play store. Most of the applications are made compatible with ARM chipset and not the Intel chipset."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/nokia-701": {
        "text": {
            "Overview": [
                "The Nokia 701 was released in October 2011. The phone has a 3.5 inch Gorilla glass touch screen with ClearBlack technology. It has 512MB RAM, and an 8GB internal memory which is expandable upto 64GB through a provided microSD slot.",
                "It is equipped with an 8MP full focus camera with 3x digital zoom and dual LED flash, and a secondary VGA camera and video recording. It also has a music player with MP3 support and surround sound, and a stereo FM radio with RDS. It also has support for A-GPS, Bluetooth and USB 2.0."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-explorer": {
        "text": {
            "Overview": [
                "After the Wildfire S, HTC has another Android phone that is priced for the ones with a short budget. The Explorer has a compact size that is convenient as compared to the huge brick-sized phones available nowadays. It runs the same HTC's Sense UI like past Wildfire models atop Android 2.3 Gingerbread. The 3.2\" HVGA (320 x 480 pixel) screen is the same as the Wildfire S, but the camera is downgraded from 5 MP auto-focus sensor to a 3MP fixed focus one. The Snapdragon processor on the HTC Explorer is clocked at 600 MHz with 512MB RAM. Internal memory, like its cousin models, is barely sufficient for installing just a few modern day apps. There's a microSD card slot to cater to your media files. The Explorer is also known as the Pico."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/gionee-elife-e5": {
        "text": {
            "Overview": [
                "Gionee Elife E5 is a launched by Chinese manufacturer Gionee, which is gaining popularity for its high quality phones at affordable prices. This smartphone supports single SIM. The screen size is 4.8 Inch HD Super AMOLED Display with 1280 x 720 pixels resolution. The phone is available in three colors viz. Yellow, Graphite Black and White. The processor used is 1.5GHz quad-core, MediaTek MT6589T chipset with 1GB of RAM memory. The smartphone has an internal storage of 16GB and cannot be expanded further, as theres no microSD card slot. The phone runs on Android OS v4.2 (Jelly Bean). About camera, the rear camera sports 8MP with flashlight, Face Detection, Geo-Tagging, Touch Focus. Also the front facing camera has 5MP clarity and can be used for video calling and taking selfies. Videos can be recorded in 1080p HD quality. Sensors used on the Elife E5 are Magnetometer, Proximity sensor, Accelerometer sensor and Ambient light sensor. The smartphone supports 2G and 3G network as well. Other typical features include WiFi, GPS, Bluetooth and FM radio as well. A Lithium-Ion 2000 mAh Battery is used that is expected to give a reasonable up-time."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/honor-play": {
        "text": {
            "Overview": [
                "With a good design and an amazing camera, the Honor Play is a competitive entry in the Indian smartphone market. With the tagline of ‘Crazy fast, crazy smart’, this is a phone that delivers on all fronts. Here is what you sign up for when you decide to buy the phone:",
                "The design is a thin metallic unibody with a tall display, which is a 6.3-inch full-HD+ IPS LCD panel with a resolution of 1080×2340 pixels and a 19.5:9 aspect ratio.",
                "Like all leading phones today, Honor Play has a dual 16MP and 2MP camera at the rear with assisted dual LED flash. A16MP camera sits at the front.",
                "The phone comes packed with Huawei’s flagship HiSilicon Kirin 970 chipset and a GPU Turbo option technology that delivers amazing performance.",
                "The call quality is improved by a new antenna design. Along with this, the phone has a huge 3750 mAh battery and comes with Huawei’s fast charger to make sure your phone never runs out of juice.",
                "The phone sports Android Oreo 8.1 with a custom skin from Huawei on top of it, known as the EMUI 8.2. Functions such as the one-hand mode, navigation gesture, and themes catalog are included."
            ]
        },
        "Pros": [
            "Large screen size with a notch and thin bezels.",
            "Long battery life.",
            "Smart AI camera with Creative features.",
            "Flagship Kirin 970 processor"
        ],
        "Cons": [
            "A tendency to mildly heat up with extended use.",
            "The camera struggles in low light."
        ]
    },
    "https://pricebaba.com/mobile/sony-xperia-t3": {
        "text": {
            "Overview": [
                "Xperia T3 is Sonys newest phablet in the market and based on the name it sounds like the successor to the Xperia T2 (but it isnt). Sony has adopted the OmniBalance design philosophy for most of its devices and the Xperia T3 is no exception. The phablets have recently shown a lot of promise in the developing markets and Sony is aiming to capitalize on the situation. Sony took the formula applied to the Xperia T2 and after a bit of changes, enter the Xperia T3.",
                "",
                "The Xperia T3 has a lot of similarities when compared to the Xperia T2. The same 1.4 GHz Cortex A7 Quad Core processors along with 1GB of RAM are in charge of the processing. The screen resolution remains the same (at 1280 x 720 pixels) along with the Triluminos display and the Mobile BRAVIA Engine 2. But the Xperia T3 is much smaller at 5.3 inches, thereby making the display sharper; and the dimensions much more handy. The device comes with the same 8GB of internal storage with MicroSD slot for expansion. The camera has been reduced to 8 megapixel sensor as compared to the 13 megapixel on the Xperia T2 with no changes to the front facing camera.",
                "",
                "The Xperia T3 comes with Android Kitkat (4.4.2) out of the box with Sony's Customizations. Sony claims it to be the slimmest 5.3 device, packing in a huge screen and components in a slim unibody construction. The battery at 2500 mAh seems like a bit of a compromise to reduce the thickness of the device, but we're guessing should be OK considering the mid-range specs of the device."
            ],
            "Frequently Asked Questions (FAQs) about the Sony Xperia T3 D5102": [
                "1. Does it support OTG?\nAns: No, it doesn’t support OTG."
            ],
            "2. Does the phone have a Hybrid SIM slot?": [
                "Ans: No, it has a dedicated slot for MicroSD card up to 32GB.",
                "",
                "3. Is the battery removable? ",
                "Ans: No, the Sony Xperia T3 comes with a 2500mAh non-removable battery.",
                "",
                "4. Does it work with Reliance Jio Network? ",
                "Ans: No, it doesn’t works with Reliance Jio Network."
            ],
            "5. What is the thickness of this phone?": [
                "Ans: Sony Xperia T3 is very slim device with only 5.3mm thickness and has a unibody construction."
            ],
            "6. What type or charging connector do I need? \nAns: It sports a micro-USB charging connector.\n\n7. What’s the Android update track record of this phone? \nAns: It was launched with Android 4.4 Kitkat with Sony’s customization on top and received the Android 5.1.1 Lollipop update.": []
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/htc-one-v": {
        "text": {
            "Overview": [
                "The younger sibling of the HTC One X, the One V is also armed with an Android 4.0 ICS operating system and the HTC Sense UI. It has a 3.7 inch display, with a curved chin design which has been an HTC trademark. The phone is built quite well thanks to its unibody construction with the use of aluminium and feels quite premium for a handset in its price-range. Also, it has 4GB internal memory (with a microSD slot for expansion) and 512MB RAM. It also has a 5MP camera with a quick one second camera start up, can also shoot HD videos, and rich sound quality thanks to Beats Audio. The HTC One V, also of the One series, is more conveniently priced than the HTC One X. In October 2012, HTC rolled out Android 4.1 (Jellybean) upgrade for the One V. The One V is replaced by the Desire X which brings in a dual-core processor, more RAM (768MB) and a removable battery."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/lenovo-s850": {
        "text": {
            "Overview": [
                "The S850 is a smartphone from the Chinese manufacturer Lenovo. The phone is well designed and sleek, 8.2mm to be precise. The device has an all glass exterior and has multi colour options. It has a 5 inch IPS display with a resolution of 1280 x 720 pixels and the pixel density is around 294 PPI. Though its not the best screen out there its still good enough for the price. The phone has a 1.3GHz Quad-core processor and has 1GB of RAM. The processor and RAM combo could have been better as Lenovo offers the same in a cheaper phone.",
                "The S850 has 16GB of internal storage but this is non expandable due to the lack of a microSD card. Lenovo has offered better cameras on the device, The back has a 13 megapixel autofocus camera with flash capable of 1080p video recording. There is a 5 megapixel wide angle camera at the front which is fixed focus. The phone runs Android Kitkat (4.4.2) with some customizations from Lenovo. It is a dual SIM device and has a non removable 2000 mAh battery which might have been compromised to keep the device sleek."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/panasonic-eluga-u2": {
        "text": {
            "Overview": [
                "Panasonic Eluga U2 is the companys mid-range offering. It has gotten most of its looks from its predecessors. It has good specifications and it closely competes with the likes of HTC Desire 510.",
                "Lets have a look at its offerings:",
                "It runs on Android 5.0 Lollipop out of the box and its the first Panasonic device to do so. It will also have the Panasonics Fit Home UI running on top of it, but since its Android, you can switch to another launcher of choice.",
                "It is powered by a 64 bit Snapdragon 410 processor which offers fast performance. Coupled with 2GB RAM, one can expect a lag free experience out of this device.",
                "It has a 13MP rear camera which would shoot sharp images and it also records 1080p videos. The front camera is a 5 megapixels which is good enough for selfies.",
                "It has a 5 IPS OGS panel. What it means is that the display is very close to the protecting glass which gives more realistic feel. A pixel density of 294PPI makes it better for reading text on this phone.",
                "Internal memory of 16GB is present on this device out of which 11GB is user available. You can attain more internal space by removing the bloatware or by making use of the expandable microSD card slot to upto 32GB.",
                "The battery on the Eluga U2 is rated at 2500mAh which will be sufficient for one working day usage.",
                "Alternatives:",
                "HTC Desire 816G Dual Sim",
                "Lenovo Vibe X2",
                "Samsung Galaxy E5"
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/iberry-auxus-4x": {
        "text": {
            "Introduction:": [
                "The iberry Auxus 4X is the first unibody premium smartphone in India with a 4GB RAM. It was launched in August 2016. The phone also has a low temperature poly-silicon display with High Color Gamut which is a highlight of the device."
            ],
            "Display and Design:": [
                "iberry Auxus 4X has a 5.5 inches full HD LCD display and has a screen resolution of 1920 x 1080 pixels. It offers 440PPI pixel density and is available in Black colour. It has a dimension of 148.4 x 74.2 x 7.3 and it weighs 143 grams. The phone has sides made of metal and has a stylish look with 178 degree viewing angle. The back panel of the phone is made of anti-scratch rugged rubber and front is protected with Dragontrail Glass Protector. The screen has a 95% high color gamut."
            ],
            "Hardware and Features:": [
                "This dual SIM device has a 2GHz octa-core Helio P10 processor, 4GB RAM and Android 6 Marshmallow Operating System. Its ARM Mali-T860 MP2 GPU provides an excellent gaming experience. It has proximity sensor, accelerometer, and ambient light sensor. The phone comes with FM and a 3.5 mm audio jack."
            ],
            "Camera and Storage:": [
                "It has a 13MP rear camera with a dual LED flash and 5MP front camera. Other advanced features in the phone include digital zoom, autofocus, touch focus, face detection and HDR. "
            ],
            "Battery and connectivity:": [
                "This smartphone comes with a 3000mAh non-removable battery that lets the users enjoy 64 hours of continuous music, 18 hours of video and 13 hours of gaming sessions. "
            ],
            "Competition:": [
                "The "
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/xolo-play": {
        "text": {
            "Overview": [
                "XOLO Play is a lower mid-range Android handset with a focus on Gaming. It has a 4.7-inch 1280 x 720 pixel IPS panel and an NVIDIA Tegra 3 chipset. With four cores running at 1.5GHz, a GeForce ULP GPU and 1GB RAM, this phone sports the same power as popular products like the HTC One X or the first version of the Nexus 7. But for a phone on which you'd expect to load intensive 3D games, the internal memory is seemingly less at 4GB, out of which roughly close to half should be available to the user. Nonetheless, there's a microSD card slot that supports up to 32GB (but remember, not all games can be transferred to external memory). NVIDIA's 'Tegra Zone' showcases games that are optimised to work best with this chipset. The XOLO Play supports 3G speeds of 21Mbps and WiFi 802.11n.",
                "Multimedia highlights of this phone include an 8 megapixel camera at the back, that does 1080p HD video recording (thanks to the Tegra 3 chip). There's also a 2MP camera up-front. Providing juice to all this hardware is a 2000mAh Lithium ion battery."
            ]
        },
        "Pros": [],
        "Cons": []
    },
    "https://pricebaba.com/mobile/samsung-galaxy-a23": {
        "text": {
            "Overview": [
                "Samsung's upcoming mid-range smartphone Samsung Galaxy A23, from its A-series lineup, seems to be nearing its launch. The smartphone will pack in some pretty decent specs. Speaking of which, we will get to see a decent display, a huge 5100mAh battery, average cameras, and will be powered by the Samsung Exynos 7 Octa 7884 SoC."
            ],
            "Design and Display": [
                "The Samsung Galaxy A23 will reportedly feature a 6.5 inch IPS LCDdisplay with a resolution of 720 x 1600 pixelsand a pixel density of 270ppi. The bezel-less display will supposedly sport an immersive punch-hole design and an aspect ratio of 20:9."
            ],
            "Cameras": [
                "The Samsung Galaxy A23 is expected to house a quad rear camera with a 16MP wide-angle primary sensor, an 8MP wide-angle sensor, a 2MP macro sensor, and a 2MP depth sensor with LED flash. Coming to the front, the device will feature a 13MP selfie shooter. The camera will arrive with features like Auto Flash, Auto Focus, Bokeh Effect, Continuos Shooting, Exposure compensation, Face detection, Geo tagging, High Dynamic Range mode (HDR), ISO control, Touch to focus, White balance presets."
            ],
            "Battery and Performance": [
                "The Samsung Galaxy A23 will come baked with the Samsung Exynos 7 Octa 7884 chipset coupled with a Mali-G71 MP2GPU. The device will come with 4GB RAM and an internal storage capacity of 64GB, which can be expanded up to 512GB. Fuelling the device will be a huge 5100mAh Li-Polymer battery with fast charging support on board."
            ],
            "Software and Connectivity": [
                "Samsung Galaxy A23 will run Android 11 out of the box. Speaking of connectivity, the smartphone will support 5G, dual sim VoLTE(Nano + Nano), Wi-Fi 802.11, b/g/n, GPS, and Bluetooth 5.2. Furthermore, the smartphone will also pack in a 3.5mm headphone jack, a USB Type-C port, and a rear-mounted fingerprint sensor as well."
            ]
        },
        "Pros": [
            "Good display and good design",
            "Large 5100mAh battery and fast charging",
            "USB type-C port and fingerprint sensor",
            "3.5mm headphone jack"
        ],
        "Cons": [
            "No AMOLED display"
        ]
    },
    "https://pricebaba.com/mobile/htc-desire-728-dual-sim": {
        "text": {
            "Overview": [
                "HTC, has been doing decent in the mid-range category, it fills the space where an individual is looking for a mid range smartphone but also cares about the brand. HTC is said to have the maximum number of devices in the price range of 10,000 to 20,000, the HTC Desire 728 being on of them."
            ],
            "Display and Design": [
                "Display on the HTC Desire 728 is a 5.5 inch LCD Panel with a resolution of 1280x720 pixels (HD) giving it a pixel density of 267PPI. Unfortunately, this time we do not get Gorilla Glass protection over the display. The phone has a Plastic body construction but the build quality looks robust with solid colour options viz. White an Purple."
            ],
            "Hardware Specifications and Other Features": [
                "Talking about the performance, the HTC Desire 728 runs on a MediaTek MT6753 Octa Core chipset clocked at 1.3GHz and paired with it is 2GB of RAM which is bare minimum for a decent multitasking experience. In terms of software the phone runs on Android 5.1 Lollipop out of the box with HTC's Sense UI running on top of it. HTC Desire 728 also features HTC BoomSound with Dolby Audio for rich audio experience."
            ],
            "Camera and Storage": [
                "On the rear of the device sits a 13MP sensor that can record videos up to 1080p, whereas on the front you get a 5MP shooter for selfies and video calling. The rear camera also has an LED Flash for taking shots in the dark. And to store all your pictures and other data you get 16GB of internal storage that can be further expanded up to 2TB via a MicroSD card."
            ],
            "Battery and Connectivity": [
                "To power all this we have a 2800mAh battery that is non-removable which sounds decent enough to last through the day. The device supports Dual SIM GSM+GSM setup and takes Nano SIM only. The device also supports 4G connectivity."
            ],
            "Competition": [
                "In the similar price range there are other quite a few new entires that rock the latest chipset and are said to have a better camera with some other improvement features as well. The Moto G4 Plus being a decent performer with good camera, fingerprint sensor and also sports near stock Android experience. Latest entry to the list is Xiaomi Mi Max with a massive 6/44 inch display with top notch specs and performance."
            ]
        },
        "Pros": [],
        "Cons": []
    }
}